{
    "57": {
        "title": "Some Data Cache Tag Eviction Errors Are Reported As Snoop Errors",
        "problem": "In some cases, the machine check error code on a data cache (DC) tag array parity error erroneously classifies an eviction error as a snoop error. The common cases of cache line replacements and external probes are classified correctly (as eviction and snoop respectively). The erroneous cases occur when a tag error is detected during a DC eviction that was generated by a hardware prefetch, a cache line state change operation, or a number of other internal microarchitectural events. In such cases, the error code logged in the DC Machine Check Status register (MC0_STATUS, MSR0000_0401) erroneously indicates a snoop error.",
        "implication": "Internally detected DC tag errors may be reported to software as having been detected by snoops. Depending upon machine check software architecture, the system response to such errors may be broader than necessary.",
        "workaround": "None required.",
        "status": "No"
    },
    "60": {
        "title": "Single Machine Check Error May Report Overflow",
        "problem": "A single parity error encountered in the data cache tag array may incorrectly report the detection of multiple errors, as indicated by the overflow bit of the DC Machine Check Status register (bit 62 of MSR0000_0401).",
        "implication": "System software may be informed of a machine check overflow when only a single error was actually encountered.",
        "workaround": "Do not rely on the state of the OVER bit in the DC Machine Check Status register.",
        "status": "No"
    },
    "77": {
        "title": "Long Mode CALLF or JMPF May Fail To Signal GP When Callgate Descriptor is Beyond GDT/LDT Limit",
        "problem": "If the target selector of a far call or far jump (CALLF or JMPF) instruction references a 16-byte long mode system descriptor where any of the last 8 bytes are beyond the GDT or LDT limit, the processor fails to report a General Protection fault.",
        "implication": "None expected, since the operating system typically aligns the GDT/LDT limit such that all descriptors are legal. However, in the case of erroneous operating system code, the above described GP fault will not be signaled, resulting in unpredictable system failure.",
        "workaround": "None required, it is anticipated that long mode operating system code will ensure the GDT and LDT limits are set high enough to cover the larger (16-byte) long mode system descriptors.",
        "status": "No"
    },
    "178": {
        "title": "Default RdPtrInit Value Does Not Provide Sufficient Timing Margin",
        "problem": "Insufficient separation of the read pointer and write pointer in the synchronization FIFO can lead to setup violations in the transmit FIFO.",
        "implication": "The setup violations may lead to data corruption.",
        "workaround": "BIOS should program F2x[1, 0]78[3:0] (RdPtrInit) to 5h.",
        "status": "Yes"
    },
    "244": {
        "title": "A DIV Instruction Followed Closely By Other Divide Instructions May Yield Incorrect Results",
        "problem": "A DIV instruction with a dividend less than 64 that is followed in close proximity by a DIV, IDIV, or AAM instruction may produce incorrect results.",
        "implication": "Possible data corruption.",
        "workaround": "Contact your AMD representative for information on a BIOS update.",
        "status": "Yes"
    },
    "246": {
        "title": "Breakpoint Due to An Instruction That Has an Interrupt Shadow May Be Delivered to the Hypervisor",
        "problem": "A #DB exception occurring in guest mode may be delivered in the host context under the following conditions: • A trap-type #DB exception is generated in guest mode during execution of an instruction with an interrupt shadow, and • The instruction that generated the exception is immediately followed by an instruction resulting in #VMEXIT.",
        "implication": "Unpredictable results due to an unexpected #DB exception.",
        "workaround": "The hypervisor should have a valid interrupt gate in the IDT of the #DB handler entry and the handler must be able to determine that this event has occurred. If the event is detected, the handler should execute an IRET back to the hypervisor; one method that could be used to evaluate for this condition is to compare the RIP pushed on the stack to the RIP of the instruction following VMRUN, if they are equivalent then this event has occurred.",
        "status": "Yes"
    },
    "248": {
        "title": "INVLPGA of A Guest Page May Not Invalidate Splintered Pages",
        "problem": "When an address mapped by a guest uses a larger page size than the host, the TLB entry created uses the size of the smaller page; this is referred to as page splintering. TLB entries that are the result of page splintering may not be invalidated when the large page is invalidated in the guest using INVLPGA.",
        "implication": "Unpredictable system behavior may result due to inconsistent entries in the TLB.",
        "workaround": "The hypervisor should always intercept INVLPGA instructions. On returning to the guest from the INVLPGA intercept the hypervisor should set TLB_Control = 1 in the VMCB to ensure correctness.",
        "status": "Yes"
    },
    "254": {
        "title": "Internal Resource Livelock Involving Cached TLB Reload",
        "problem": "Under a highly specific and detailed set of conditions, an internal resource livelock may occur between a TLB reload and other cached operations.",
        "implication": "The system may hang.",
        "workaround": "BIOS should set MSRC001_1023[21] to 1b.",
        "status": "Yes"
    },
    "260": {
        "title": "REP MOVS Instruction May Corrupt Source Address",
        "problem": "The processor may corrupt the source address for REP MOVS instructions using 16- or 32-bit addressing when a fault occurs on the first iteration and ECX is greater than 255 and EDI equals 0.",
        "implication": "Unpredictable system behavior.",
        "workaround": "Contact your AMD representative for information on a BIOS update.",
        "status": "Yes"
    },
    "261": {
        "title": "Processor May Stall Entering Stop-Grant Due to Pending Data Cache Scrub",
        "problem": "The processor may stall if a correctable error is identified by the data cache scrubber within a small window of time before the processor enters a stop-grant state when another scrub is pending.",
        "implication": "The system may hang.",
        "workaround": "BIOS should set MSRC001_1022[24].",
        "status": "No"
    },
    "263": {
        "title": "Incompatibility With Some DIMMs Due to DQS Duty Cycle Distortion",
        "problem": "Some DIMMs exhibit a duty cycle distortion on the first DQS pulse of an incoming read request which may cause the processor's DRAM interface to miss a beat of data in a read burst.",
        "implication": "Undefined system behavior due to incorrect read data.",
        "workaround": "If the memory is DDR2-533 or DDR2-667 or DDR3-667 write 00000800h to F2x[1,0]9C_xD040F30, else write 00000000h to F2x[1,0]9C_xD040F30. The write of 00000000h to F2x[1, 0]9C_xD040F30 is not necessary if BIOS can not change the memory clock speed without a cold reset or if BIOS does not support the above mentioned memory configurations. When exiting from the S4 or S5 state, apply this workaround prior to setting DRAM Configuration Low Register[InitDram] (F2x[1,0]90[0]). In addition, for the above mentioned memory configurations, BIOS should set the DRAM read DQS timing control loop range to 32 during DQS position training. When exiting from the S3 state, apply this workaround prior to setting DRAM Configuration Low Register[ExitSelfRef] (F2x[1,0]90[1]).",
        "status": "No"
    },
    "264": {
        "title": "Incorrect DRAM Data Masks Asserted When DRAM Controller Data Interleaving Is Enabled",
        "problem": "The processor may incorrectly assert the DRAM data masks for writes less than a cache line when DRAM controller data interleaving is enabled.",
        "implication": "Data corruption.",
        "workaround": "BIOS should set MSRC001_001F[36] (DisDatMsk) to 1b when F2x110[5] (DctDatIntLv) is set to 1b.",
        "status": "Yes"
    },
    "269": {
        "title": "ITT Specification Exceeded During Power-Up Sequencing",
        "problem": "Processor current consumption may exceed the ITT maximum specified for C0/S0 operation if the VTT voltage regulator is enabled before the VDDIO voltage regulator and the VDDIO regulator enables a low resistance path to VSS while VTT - VDDIO > 400 mV.",
        "implication": "The VTT voltage regulator may shut down if ITT exceeds the platform design limit.",
        "workaround": "None required if either of the following are true: • The VTT regulator is enabled at the same time or after the VDDIO regulator. • The VDDIO regulator does not enable a low resistance path to VSS while VTT - VDDIO > 400 mV. For affected systems, the VTT voltage regulator should be enabled at the same time or after the VDDIO voltage regulator during power-up power sequencing. Existing specifications limiting the VDDIO to VTT relationship must be maintained.",
        "status": "No"
    },
    "273": {
        "title": "Lane Select Function Is Not Available for Link BIST on 8-Bit HyperTransport™ Links In Ganged Mode",
        "problem": "The link BIST engine incorrectly initiates tests on sublink 1 rather than sublink 0 under the following conditions: • The HyperTransport™ link is configured as an 8-bit link in ganged mode, • LaneSel[1], F0x[18C:170][13], is set to 1b, • BistEn, F0x[18C:170][10], is set to 1b, and • BIST is initiated by assertion of warm reset or a LDTSTOP_L disconnect.",
        "implication": "No impact to normal operational mode; however, the lane select function is not available for testing asymmetric links or isolation of errors to the uplink or downlink on symmetric links.",
        "workaround": "None.",
        "status": "Yes"
    },
    "274": {
        "title": "IDDIO Specification Exceeded During Power-Up Sequencing",
        "problem": "Processor current consumption may exceed the IDDIO maximum specified for C0/S0 operation during power-up sequencing.",
        "implication": "None expected if the VDDIO voltage regulator is sourced by a RUN (running) plane from the power supply during power-up sequencing. Otherwise, during power-up sequencing the VDDIO voltage regulator may shut down if IDDIO exceeds the platform budget or the power supply may shut down if the SUS (suspend) rail current capacity is exceeded.",
        "workaround": "Three options exist to ensure the VDDIO voltage regulator is sourced with sufficient current during processor power-up sequencing: 1. Enable the VDDIO voltage regulator after POWER_GOOD is asserted from the high-current (RUN) source rail. 2. Provide a path for a high-current (RUN) rail to source current to the VDDIO voltage regulator prior to POWER_GOOD assertion from the high-current (RUN) rail. This solution assumes the high-current (RUN) rail is enabled early enough relative to enabling the VDDIO voltage regulator. 3. Choose a power supply with increased capacity for the rail sourcing the VDDIO voltage regulator during power-up sequencing. The capacity required is system specific and should allocate 7 A per processor in the power budget. The following is an example of a supply current capacity calculation assuming a 5 V suspend rail and 3 W rest of system power for a single-processor system. Other platform-specific factors such as power supply or regulator efficiencies should also be considered. • Rest of system (non-processor) power = 3 W • Processor power = 7 A/processor * 1 processor * 1.8 V = 12.6 W • Source rail capacity = (rest of system power + processor power) / source rail voltage; (3 W + 12.6 W) / 5 V = 3.12 A",
        "status": "Yes"
    },
    "278": {
        "title": "Incorrect Memory Controller Operation In Ganged Mode",
        "problem": "The DRAM controller 0 (DCT0) and DRAM controller 1 (DCT1) refresh counters may not be initialized to the same value using hardware controlled DRAM initialization when operating in ganged mode.",
        "implication": "Incorrect memory controller operation.",
        "workaround": "BIOS should apply the following workaround prior to DRAM training when using hardware- controlled DRAM initialization and F2x110[4] (DctGangEn) is set to 1b. 1. Disable automatic refresh cycles by setting F2x8C[18] (DisAutoRefresh) to 1b. 2. Begin DRAM initialization by setting F2x90[0] to 1b. 3. Poll F2x90[0] until it reads 0b then wait at least 50 microseconds. 4. Enable automatic refresh cycles by clearing F2x8C[18] (DisAutoRefresh) to 0b. 5. Disable automatic refresh cycles by setting F2x8C[18] (DisAutoRefresh) to 1b. 6. Enable automatic refresh cycles by clearing F2x8C[18] (DisAutoRefresh) to 0b. 7. Begin DRAM training. In addition, when resuming from S3, BIOS should apply the following workaround. 1. Disable automatic refresh cycles by setting F2x8C[18] (DisAutoRefresh) to 1b. 2. Initiate exit from self-refresh by setting F2x90[1] to 1b. 3. Poll F2x90[1] until it reads 0b then wait at least 50 microseconds. 4. Enable automatic refresh cycles by clearing F2x8C[18] (DisAutoRefresh) to 0b. 5. Disable automatic refresh cycles by setting F2x8C[18] (DisAutoRefresh) to 1b. 6. Enable automatic refresh cycles by clearing F2x8C[18] (DisAutoRefresh) to 0b.",
        "status": "Yes"
    },
    "279": {
        "title": "HyperTransport™ Link RTT and RON Specification Violations",
        "problem": "The RTT and RON specifications for the HyperTransport™ link may be violated on some processor revisions.",
        "implication": "These violations do not result in any other HyperTransport™ link electrical specification violations. There are no known functional failures related to this problem.",
        "workaround": "None required.",
        "status": "Yes"
    },
    "280": {
        "title": "Time Stamp Counter May Yield An Incorrect Value",
        "problem": "Reads of the time stamp counter may yield an inconsistent result.",
        "implication": "Undefined behavior for software that relies on a continuously increasing time stamp counter value.",
        "workaround": "Contact your AMD representative for information on a BIOS upgrade.",
        "status": "Yes"
    },
    "293": {
        "title": "Memory Instability After PWROK Assertion",
        "problem": "The DRAM DQS DLL may not lock properly after PWROK is asserted.",
        "implication": "The system may have degraded memory margins leading to unreliable DRAM signaling. In some circumstances, this may cause BIOS to degrade the memory speed.",
        "workaround": "During DRAM controller (DCT) initialization, system software should perform the following workaround to every enabled DCT in the system: 1. Perform a dummy DRAM read to any address on any DIMM attached to the DCT. 2. Write 0000_8000h to register F2x[1, 0]9C_xD080F0C. 3. Wait at least 300 nanoseconds. 4. Write 0000_0000h to register F2x[1, 0]9C_xD080F0C. 5. Wait at least 2 microseconds. When exiting from the S4 or S5 state, apply the workaround immediately prior to the Receiver Enable Training. During resume from the S3 state, apply the workaround after F2x[1, 0]90[ExitSelfRef] has been cleared and prior to restoring the F2x[1, 0]9C registers.",
        "status": "Yes"
    },
    "295": {
        "title": "DRAM Phy Configuration Access Failures",
        "problem": "Under a highly specific set of asynchronous timing conditions established during cold boot (S5 to S0 transition) or resume (S4 or S3 to S0 transition), the skew between the DRAM controllers (DCTs) and DRAM phy may lead to unreliable communication for DRAM phy configuration accesses.",
        "implication": "The system may hang during DRAM configuration accesses when using DCT link ganged mode ([DRAM Controller Select Low Register] F2x110[DctGangEn] = 1b), or fail DRAM training in link ganged mode or in link unganged mode.",
        "workaround": "Contact your AMD representative for information on a BIOS update.",
        "status": "Yes"
    },
    "297": {
        "title": "Single Machine Check Error May Report Overflow",
        "problem": "A single tag snoop parity error encountered in the instruction cache tag array may incorrectly report the detection of multiple errors, as indicated by the overflow bit of the IC Machine Check Status register (MSR0000_0405[62]).",
        "implication": "System software may be informed of a machine check overflow when only a single error was actually encountered.",
        "workaround": "None required.",
        "status": "No"
    },
    "298": {
        "title": "L2 Eviction May Occur During Processor Operation To Set Accessed or Dirty Bit",
        "problem": "The processor operation to change the accessed or dirty bits of a page translation table entry in the L2 from 0b to 1b may not be atomic. A small window of time exists where other cached operations may cause the stale page translation table entry to be installed in the L3 before the modified copy is returned to the L2. In addition, if a probe for this cache line occurs during this window of time, the processor may not set the accessed or dirty bit and may corrupt data for an unrelated cached operation.",
        "implication": "One or more of the following events may occur: • Machine check for an L3 protocol error. The MC4 status register (MSR0000_0410) is B2000000_000B0C0Fh or BA000000_000B0C0Fh. The MC4 address register (MSR0000_0412) is 26h. • Loss of coherency on a cache line containing a page translation table entry. • Data corruption.",
        "workaround": "BIOS should set MSRC001_0015[3] (HWCR[TlbCacheDis]) to 1b and MSRC001_1023[1] to 1b. In a multiprocessor platform, the workaround above should be applied to all processors regardless of revision when an affected processor is present.",
        "status": "Yes"
    },
    "300": {
        "title": "Hardware Memory Clear Is Not Supported After Software DRAM Initialization",
        "problem": "When using software-controlled DRAM device initialization using EnDramInit (F2x[1, 0]7C DRAM Initialization Register[31]), hardware memory clear using MemClrInit (F2x110 DRAM Controller Select Low Register[3]) does not function.",
        "implication": "After BIOS sets MemClrInit (F2x110[3]), the hardware will not clear memory and will not set MemCleared (F2x110[10]). The BIOS will hang waiting for the operation to complete.",
        "workaround": "BIOS should use hardware initialization of DRAM using InitDram (F2x[1, 0]90 DRAM Configuration Low Register[0]). If BIOS uses software initialization, alternative methods to initialize ECC must be used.",
        "status": "Yes"
    },
    "301": {
        "title": "Performance Counters Do Not Accurately Count MFENCE or SFENCE Instructions",
        "problem": "MFENCE and SFENCE instructions are not accurately counted by the performance monitor when MSRC001_000[3:0][7:0] (EventSelect) is 1D4h, or 1D5h.",
        "implication": "Performance monitoring software will not be able to count MFENCE and SFENCE instructions.",
        "workaround": "None.",
        "status": "Yes"
    },
    "302": {
        "title": "MWAIT Power Savings May Not Be Realized when Two or More Cores Monitor the Same Address",
        "problem": "Execution of the MONITOR instruction may cause another core to exit the monitor event pending state.",
        "implication": "No functional impact; however, the power savings associated with the MWAIT instruction may not be realized.",
        "workaround": "Contact your AMD representative for information on a BIOS update.",
        "status": "Yes"
    },
    "308": {
        "title": "Processor Stall in C1 Low Power State",
        "problem": "Under a highly specific set of internal timing conditions, an L3 eviction may stall for a processor core that has entered the C1 (halt) state. If the processor core has already entered the low power state and the CpuPrbEn bit in the C1 SMAF is 0b (F3x84[24]), the stall persists until the processor core comes out of the low power state.",
        "implication": "The system may hang.",
        "workaround": "Contact your AMD representative for information on a BIOS update.",
        "status": "Yes"
    },
    "309": {
        "title": "Processor Core May Execute Incorrect Instructions on Concurrent L2 and Northbridge Response",
        "problem": "Under a specific set of internal timing conditions, an instruction fetch may receive responses from the L2 and the northbridge concurrently. When this occurs, the processor core may execute incorrect instructions.",
        "implication": "Unpredictable system behavior.",
        "workaround": "BIOS should set MSRC001_1023[23].",
        "status": "Yes"
    },
    "312": {
        "title": "CVTSD2SS and CVTPD2PS Instructions May Not Round to Zero",
        "problem": "The Convert Scalar Double-Precision Floating-Point to Scalar Single-Precision Floating-Point (CVTSD2SS) and Convert Packed Double-Precision Floating-Point to Packed Single-Precision Floating-Point (CVTPD2PS) instructions do not round to zero when the Flush to Zero and Underflow Mask bits (MXCSR bits 15 and 11) are set to 1b and the double-precision operand is less than the smallest single-precision normal number.",
        "implication": "The conversion result will yield the smallest single-precision normalized number rather than zero. It is not expected that this will result in any anomalous software behavior since enabling flush to zero provides less precise results.",
        "workaround": "None.",
        "status": "Yes"
    },
    "315": {
        "title": "FST and FSTP Instructions May Calculate Operand Address in Incorrect Mode",
        "problem": "A Floating-Point Store Stack Top (FST or FSTP) instruction in 64-bit mode that is followed shortly by an instruction that changes to compatibility mode may incorrectly calculate the operand address using compatibility mode. Also, an FST or FSTP instruction in compatibility mode that is followed shortly by an instruction that changes to 64-bit mode may incorrectly calculate the operand address using 64-bit mode. The incorrect mode for address calculation is only used under highly specific internal timing conditions and when the Underflow Mask bit (FCW bit 4) is set and the data to be stored by the FST or FSTP instruction is a denormalized (tiny) number.",
        "implication": "The processor may store to an incorrect address. This may cause an unexpected page fault or unpredictable system behavior. This sequence has not been observed in any production software.",
        "workaround": "Contact your AMD representative for information on a BIOS update.",
        "status": "Yes"
    },
    "319": {
        "title": "Inaccurate Temperature Measurement",
        "problem": "The internal thermal sensor used for CurTmp (F3xA4[31:21]), hardware thermal control (HTC), software thermal control (STC) thermal zone, and the sideband temperature sensor interface (SB-TSI) may report inconsistent values. For CPUID Fn0000_0001_EAX[7:4] (Model) 4 and higher, this temperature inconsistency will occur only on AM2r2, Fr2, Fr5 and Fr6 package processors",
        "implication": "HTC, STC thermal zone, and SB-TSI do not provide reliable thermal protection. This does not affect THERMTRIP or the use of the STC-active state using StcPstateLimit or StcPstateEn (F3x68[30:28, 5]).",
        "workaround": "None. Platforms that accept AM2r2, Fr2 (1207), Fr5 (1207) or Fr6 (1207) package processors should be designed with conventional thermal control and throttling methods or utilize PROCHOT_L functionality based on temperature measurements from an analog thermal diode (THERMDA/THERMDC). These systems should not rely on the HTC features, STC thermal zone features, or use SB-TSI. When (((CPUID Fn8000_0001_EBX[PkgType, bits 31:28] == 1 (AM2r2 or AM3)) && (F2x[1, 0]94[Ddr3Mode, bit 8] == 0)) || (CPUID Fn8000_0001_EBX[31:28] == 0 (F (1207)))), software should not modify HtcTmpLmt (F3x64[22:16]), utilize the value from CurTmp, or enable any of the STC thermal zone features by setting StcThrottEn, StcApcTmpLoEn, StcApcTmpHiEn, StcSbcTmpLoEn, or StcSpcTmpHiEn (F3x68[4,3:0]).",
        "status": "Yes"
    },
    "322": {
        "title": "Address and Command Fine Delay Values May Be Incorrect",
        "problem": "The DRAM phy uses the memory speed at the time of DRAM initialization or self-refresh exit to adjust the fine delay values based on internal DLL settings. Data written to fine delay registers prior to DRAM initialization or self-refresh exit may be adjusted incorrectly. No effect is observed for all fine delays except those in the DRAM Address/Command Timing Control Register at F2x[1,0]9C_x04; these are written after DRAM initialization. However, F2x[1,0]9C_x04 may be written before DRAM initialization or self-refresh exit and may result in an incorrect adjustment. This erratum only affects MEMCLK frequencies of 400 MHz and higher.",
        "implication": "The system may have degraded memory margins leading to unreliable DRAM signaling.",
        "workaround": "The following workaround should be applied by BIOS prior to writing F2x[1,0]9C_x04 during DRAM controller (DCT) initialization and during the S3 resume sequence: 1. Write 00000000h to F2x[1,0]9C_xD08E000. 2. In unganged mode (DRAM Controller Select Low Register [DctGangEn] (F2x110[4]) = 0b), if DRAM Configuration Register[MemClkFreq] (F2x[1,0]94[2:0]) is greater than or equal to 011b, write 00000080h to F2x[1,0]9C_xD02E001, else write 00000090h to F2x[1,0]9C_xD02E001. 3. In ganged mode (DRAM Controller Select Low Register [DctGangEn] (F2x110[4]) = 1b), if DRAM Configuration Register[MemClkFreq] (F2x94[2:0]) is greater than or equal to 011b, write 00000080h to F2x9C_xD02E001 and F2x19C_xD02E001, else write 00000090h to F2x9C_xD02E001 and F2x19C_xD02E001. The write of 00000090h to F2x[1,0]9C_xD02E001 is not necessary if BIOS can not change the memory clock speed without a cold reset.",
        "status": "No"
    },
    "326": {
        "title": "Misaligned Load Operation May Cause Processor Core Hang",
        "problem": "Under a highly specific set of internal timing conditions, load operations with a misaligned operand may hang. Any instruction loading data from memory without a LOCK prefix where the first byte and the last byte are in separate octal words may cause the condition mentioned above.",
        "implication": "Processor core hang.",
        "workaround": "BIOS should clear MSRC001_1022[43:42].",
        "status": "Yes"
    },
    "327": {
        "title": "HyperTransport™ Link RTT Specification Violation",
        "problem": "The RTT specification for the HyperTransport™ link may be violated on some processor revisions.",
        "implication": "These violations do not result in any other HyperTransport™ link electrical specification violations. There are no known functional failures related to this problem.",
        "workaround": "BIOS should set the Link Phy Impedance Register[RttCtl] (F4x1[9C, 94, 8C, 84]_x[D0, C0][31:29]) to 010b and Link Phy Impedance Register[RttIndex] (F4x1[9C, 94, 8C, 84]_x[D0, C0][20:16]) to 00100b.",
        "status": "No"
    },
    "328": {
        "title": "BIST May Report Failures on Initial Powerup",
        "problem": "When BIST is run after initial powerup, a non-zero (i.e., failing) value may be erroneously reported in EAX. Subsequent BIST runs (induced by warm resets) are not affected by this erratum, and accurately report pass/fail as determined by the presence or absence of detectable defects in the structures tested.",
        "implication": "The processor may incorrectly represent itself as being defective on initial powerup. The system response to this is system software dependent.",
        "workaround": "On initial powerup, system software should disregard the BIST result in EAX.",
        "status": "Yes"
    },
    "336": {
        "title": "Instruction-Based Sampling May Be Inaccurate",
        "problem": "The processor may experience sampling inaccuracies when Instruction-Based Sampling (IBS) is enabled in the following cases: • The IBS may not tag an operation when the current counter in IBS Execution Control Register[IbsOpCurCnt] (MSRC001_1033[51:32]) reaches the value in IBS Fetch Control Register[IbsOpMaxCnt] (MSRC001_1030[15:0], resulting in a missed sample. When this occurs, the IBS counter rolls over without an interrupt. • The selection of instructions for IBS may be significantly skewed due to effects of instruction cache misses and branch prediction. As a result, certain instructions may be tagged less frequently than other instructions even when executed in the same code block.",
        "implication": "Inaccuracies in performance monitoring software may be experienced. Despite this erratum, IBS can be used effectively for identifying performance issues associated with specific instructions. The sampling bias makes IBS less effective for measuring statistical distribution of operations and events across a large code sequence on affected processor revisions.",
        "workaround": "None.",
        "status": "Yes"
    },
    "337": {
        "title": "CPU Instruction-Based Sampling Fields May Be Inaccurate",
        "problem": "The processor may experience sampling inaccuracies when Instruction-Based Sampling (IBS) is enabled in the following fields: • IBS Op Data Register[IbsCompToRetCtr] (MSRC001_1035[15:0]) may be incorrect for floating-point instructions, when IBS Op Data 3 Register[IbsStOp] (MSRC001_1037[1]) is set, or when IBS Op Data 3 Register[IbsLdOp] (MSRC001_1037[0]) is set. • IBS Op Data 3 Register[IbsDcMissLat] (MSRC001_1037[47:32]) may be incorrect if the processor tags a load instruction for IBS and the data for a retired store operation is in the process of being written to the data cache. As a result, IbsDcMissLat may start counting early when the load instruction is tagged and may be non-zero on a data cache hit. • IBS Op Data 3 Register[IbsDcStToLdFwd, IbsDcL2TlbHit2M, IbsDcL2TlbMiss] (MSRC001_1037[11, 6, 3]) may be incorrect when IBS Op Data 3 Register[IbsDcStBnkCon] (bit 10) or IBS Op Data 3 Register[IbsDcLdBnkCon] (bit 9) are set. • IBS Op Data 3 Register[IbsLdOp, IbsStOp] (MSRC001_1037[1:0]) may be set incorrectly for non load/store instructions that are tagged for IBS. Other fields in MSRC001_1037 may also be set based on an unrelated instruction. This occurs when a load/store instruction is tagged and then a branch misprediction causes it to be canceled. When a new instruction is tagged for IBS, it may trigger incorrect information if the same buffers are used for both instructions. This typically would not result in a statistically significant number of incorrect samples. • IBS Op Logical Address Register (MSRC001_1034) may not point to the sampled instruction when highly specific conditions are met for the sampled and surrounding instructions. In these cases, the address reported may be 16 bytes past the sampled instruction and may not point to the beginning of an actual instruction.",
        "implication": "Inaccuracies in performance monitoring software may be experienced.",
        "workaround": "None.",
        "status": "Yes"
    },
    "338": {
        "title": "Northbridge Instruction-Based Sampling Fields May Be Inaccurate",
        "problem": "The IBS Op Data 2 Register[NbIbsReqDstProc] (MSRC001_1036[4]) may be incorrect when the northbridge is performing back-to-back operations while an instruction tagged for Instruction-Based Sampling (IBS) is executed and IBS Op Data 2 Register[NbIbsReqSrc] (MSRC001_1036[2:0]) is 011b or 111b. This typically would not result in a statistically significant number of incorrect samples.",
        "implication": "Inaccuracies in performance monitoring software may be experienced.",
        "workaround": "None.",
        "status": "Yes"
    },
    "339": {
        "title": "APIC Timer Rollover May Be Delayed",
        "problem": "The APIC timer does not immediately rollover when it transitions to zero and Timer Local Vector Table Entry[Mode] (APIC320[17]) is configured to run in periodic mode. In addition, when Timer Local Vector Table Entry[Mask] (APIC320[16]) is configured to generate an interrupt, the interrupt is also delayed whether configured for periodic or one-shot mode. The per rollover error that may be observed is between 35 and 90 ns.",
        "implication": "None expected. The standard use of the APIC timer and the level of accuracy required does not make the error significant.",
        "workaround": "None required.",
        "status": "No"
    },
    "342": {
        "title": "SMIs That Are Not Intercepted May Disable Interrupts",
        "problem": "During a resume from SMM that is due to an unintercepted SMI from a SVM guest context, the processor core does not restore the correct effective interrupt flag (IF) if the guest VMCB V_INTR_MASKING bit (offset 060h bit 24) is 1b. Under these circumstances, the effective interrupt flag may be zero. SMIs are not intercepted if VMCB offset 00Ch bit 2 is 0b or HWCR[SmmLock] (MSRC001_0015[0]) is 1b.",
        "implication": "The guest context may run with interrupts disabled until the next guest intercept. The hypervisor may not be able to regain control and the system may hang.",
        "workaround": "Contact your AMD representative for information on a BIOS update.",
        "status": "Yes"
    },
    "343": {
        "title": "Eviction May Occur When Using L2 Cache as General Storage During Boot",
        "problem": "When system software is using the L2 cache as general storage before memory initialization, the processor may determine during speculative execution that data destined for the instruction cache is dirty. The processor will then evict these cache lines, resulting in lost data.",
        "implication": "System software using L2 cache as general storage before memory initialization may experience unpredictable system behavior.",
        "workaround": "System software should set MSRC001_102A[35] to 1b prior to using L2 cache as general storage during boot. System software should clear MSRC001_102A[35] to 0b after the L2 cache is no longer used as general storage.",
        "status": "No"
    },
    "344": {
        "title": "Intermittent HyperTransport™ Link Training Failures",
        "problem": "The HyperTransport™ link training may fail at speeds greater than 2.0 GT/s.",
        "implication": "When exiting from S3, S4 or S5 state, the system may hang when a reset or LDTSTOP is applied and the link speed is greater than 2.0 GT/s. In addition, when F0x[18C:170][Ls2En] is set the system may hang exiting from LS2 link power state if the link speed is greater than 2.0 GT/s.",
        "workaround": "System software should set bit 6 of F4x1[9C, 94, 8C, 84]_x[78:70, 68:60]. The bits should be set before the link frequency is changed from the cold reset value.",
        "status": "No"
    },
    "346": {
        "title": "System May Hang if Core Frequency is Even Divisor of Northbridge Clock",
        "problem": "When one processor core is operating at a clock frequency that is higher than the northbridge clock frequency, and another processor core is operating at a clock frequency that is an even divisor of the northbridge clock frequency, the northbridge may fail to complete a cache probe.",
        "implication": "System hang.",
        "workaround": "System software should set F3x188[22] to 1b.",
        "status": "Yes"
    },
    "348": {
        "title": "Processor On-die Termination Resistance is Higher than Specification",
        "problem": "The actual processor on-die termination resistance for DDR2 mode differs from the values specified for F2x[1, 0]9C_x00[29:28] (ProcOdt) in the BIOS and Kernel Developer’s Guide (BKDG) for AMD Family 10h Processors, order# 31116 as shown in the table below: ProcOdt Specification in DDR2 mode Silicon Implementation 00b 300 ohms +/- 20% 480 ohms +/- 20% 01b 150 ohms +/- 20% 240 ohms +/- 20% 10b 75 ohms +/- 20% 120 ohms +/- 20% 11b Reserved Reserved",
        "implication": "Increased ODT resistance may affect DDR2 memory margins.",
        "workaround": "None.",
        "status": "Yes"
    },
    "350": {
        "title": "DRAM May Fail Training on Cold Reset",
        "problem": "The DRAM DQS DLL may not lock after PWROK is asserted, resulting in a DRAM training failure.",
        "implication": "The system may fail to boot.",
        "workaround": "During DRAM controller (DCT) initialization, system software should perform the following workaround to every enabled DCT in the system: 1. Perform a dummy DRAM read to any address on any DIMM attached to the DCT. 2. Write 0000_8000h to register F2x[1, 0]9C_xD080F0C. 3. Wait at least 300 nanoseconds. 4. Write 0000_0000h to register F2x[1, 0]9C_xD080F0C. 5. Wait at least 2 microseconds. When exiting from the S4 or S5 state, apply the workaround immediately prior to the Receiver Enable Training. During resume from the S3 state, apply the workaround after F2x[1, 0]90[ExitSelfRef] has been cleared and prior to restoring the F2x[1, 0]9C registers.",
        "status": "No"
    },
    "351": {
        "title": "HyperTransport™ Technology LS2 Low-Power Mode May Not Function Correctly",
        "problem": "The HyperTransport™ technology LS2 low-power state may not function correctly in all systems.",
        "implication": "System hang or video distortion due to excessive latency.",
        "workaround": "System software should program the Link Extended Control Registers[LS2En] (F0x[18C:170][8]) to 0b for all links. This allows the LS1 low-power state to be used as an alternative to LS2. System software should also program Link Global Extended Control Register[ForceFullT0] (F0x16C[15:13]) to 000b.",
        "status": "Yes"
    },
    "352": {
        "title": "SYSCALL Instruction May Execute Incorrectly Due to Breakpoint",
        "problem": "A SYSCALL instruction executes incorrectly and an incorrect debug exception is taken when all of the following conditions are satisfied: • An enabled instruction breakpoint address matches the RIP of the SYSCALL instruction. • The processor is in 64-bit mode or compatibility mode. • The instruction would not generate any other exception. • SYSCALL Flag Mask Register[16] (MSRC000_0084[16]) is set to 1b. • rFLAGS.RF is set to 1b.",
        "implication": "None expected during normal operation. Kernel debuggers may observe unpredictable system behavior.",
        "workaround": "Operating system software should clear SYSCALL Flag Mask Register[16] (MSRC000_0084[16]) to 0b during initialization.",
        "status": "Yes"
    },
    "353": {
        "title": "SYSRET Instruction May Execute Incorrectly Due to Breakpoint",
        "problem": "A SYSRET instruction executes incorrectly and an incorrect debug exception is taken when all of the following conditions are satisfied: • An enabled instruction breakpoint address matches the RIP of the SYSRET instruction. • The processor is in 64-bit mode or compatibility mode. • The instruction would not generate any other exception. • R11[16] is cleared to 0b. • rFLAGS.RF is set to 1b.",
        "implication": "None expected during normal operation. Kernel debuggers may observe unpredictable system behavior.",
        "workaround": "Software should set R11[16] to 1b before executing the SYSRET instruction in 64-bit mode.",
        "status": "Yes"
    },
    "354": {
        "title": "HyperTransport™ Link Training Failure",
        "problem": "Some processors may fail HyperTransport™ link training at speeds greater than 2.0 GT/s. The link training failure may be intermittent.",
        "implication": "When exiting from S3, S4 or S5 state, the system may hang when a reset or LDTSTOP is applied and the link speed is greater than 2.0 GT/s. In addition, when F0x[18C:170][Ls2En] is set the system may hang exiting from LS2 link power state if the link speed is greater than 2.0 GT/s.",
        "workaround": "System software should set bit 6 of F4x1[9C,94,8C,84]_x[58:50, 48:40] for all links. The bits should be set before the link frequency is changed from the cold reset value.",
        "status": "Yes"
    },
    "355": {
        "title": "DRAM Read Errors May Occur at Memory Speeds Higher than DDR2-800",
        "problem": "The processor DRAM interface may miss a beat of data under conditions of back-to-back read bursts to the same chip select using DDR2-1066 memory speed, resulting in incorrect data read by the DRAM interface until a processor reset occurs. This issue is sensitive to processor VDDIO and VTT voltage settings.",
        "implication": "Undefined system behavior that usually results in a system hang due to a triple fault.",
        "workaround": "None.",
        "status": "Yes"
    },
    "359": {
        "title": "MEMCLK is Not Provided for Minimum Specified Time Before CKE Assertion",
        "problem": "During hardware DDR2 device initialization, the processor does not provide a running MEMCLK for the specified minimum time of 200 microseconds before CKE is asserted.",
        "implication": "No adverse effects have been observed. The processor does not initiate a DRAM access for over 200 microseconds from the start of MEMCLK and the assertion of CKE. If a DDR2 DIMM is sensitive to this issue, the system may fail to boot.",
        "workaround": "None required.",
        "status": "Yes"
    },
    "360": {
        "title": "DRAM CKE and Address Drive Strength Values May Be Incorrect",
        "problem": "The processor does not correctly assign DRAM Output Driver Compensation Control Register[CkeDrvStren] (F2x[1,0]9C_x00[1:0]) and DRAM Output Driver Compensation Control Register[AddrCmdDrvStren] (F2x[1,0]9C_x00[9:8]) to the specified DRAM pins. Differences from the specified assignments are shown in the following table; other assignments are not affected: Missing Assigned DRAM Register Field Extra Assigned DRAM Pins Pins CkeDrvStren DRAM address pins 1, 2 and 3 CKE AddrCmdDrvStren CKE DRAM address pins 1, 2 and 3 This erratum applies only when programming two different settings to the CkeDrvStren and AddrCmdDrvStren register fields. Functionality is correct when the two register fields are programmed to identical values.",
        "implication": "Pin drive strengths that differ from those expected may affect memory margins.",
        "workaround": "No workaround required for system designers using AMD recommended values in these fields. With the AMD recommended values, the erratum does not apply to any settings in 1T timing mode. A workaround is not necessary in 2T timing mode as the impact of this erratum to overall memory margins is minimal.",
        "status": "No"
    },
    "361": {
        "title": "Breakpoint Due to an Instruction That Has an Interrupt Shadow May Be Lost",
        "problem": "A #DB exception occurring in guest mode may be discarded under the following conditions: • A trap-type #DB exception is generated in guest mode during execution of an instruction with an interrupt shadow, and • The instruction that generated the exception is immediately followed by an instruction resulting in #VMEXIT.",
        "implication": "None expected under normal conditions. Debug exceptions may not be received for programs running under a hypervisor.",
        "workaround": "None.",
        "status": "No"
    },
    "362": {
        "title": "Illegal Packet on HyperTransport™ Link May Prevent Warm Reset",
        "problem": "The processor may fail to drive external pins to their reset pattern when warm reset is asserted, and may fail to restart after warm reset is subsequently deasserted, when both of the following conditions are satisfied: • The processor has received an illegal packet from a non-coherent HyperTransport™ link with a specific encoding only used on coherent links. This packet may be detected near a warm reset as the processor may sample packets on the link for a brief time after warm reset is asserted. On some platforms, the conditions under which the processor may receive an illegal packet near a warm reset may not be observed. If link retry mode is enabled, this erratum applies only if the incoming illegal packet contains a valid CRC. • One or more processor cores is in the C1 halt state with clocks ramped down. If C1 ACPI Power State Control Registers [CpuPrbEn] (F3x84[24]) = 1b, clocks are considered as ramped down for a processor core in the C1 halt state for any valid setting of F3x84[31:29] (ClkDivisor) other than 000b.",
        "implication": "System hang during a warm reset. This erratum does not impact cold reset or INIT.",
        "workaround": "None required for platforms that do not observe this issue. For other platforms, platform BIOS should set a global SMI trap on any write to a port that could cause warm reset to assert, and then execute the write from within the SMI handler. This ensures that no cores have clocks ramped down when warm reset is asserted. This workaround is not effective for warm resets that are initiated without a software write to a port that can be trapped.",
        "status": "Yes"
    },
    "370": {
        "title": "DRAM Read Errors May Occur at DDR2-800 Memory Speeds With Higher Read DQS Delays",
        "problem": "The processor DRAM interface may miss a beat of data under conditions of back-to-back read bursts to the same chip select using DDR2-800 memory speeds, resulting in incorrect data read by the DRAM interface until a processor reset occurs. This issue is sensitive to higher levels of jitter on the read DQS inputs from DRAM in combination with higher settings of DRAM Read DQS Timing Control [High:Low] Registers[RdDqsTimeByte][7:0] at offsets F2x[1, 0]9C_x[3:0]0[6:5].",
        "implication": "For systems without ECC, undefined system behavior that usually results in a system hang due to a triple fault. Systems with ECC enabled may experience repeated multiple-bit ECC errors.",
        "workaround": "If the system DRAM speed is DDR2-800, system software should constrain the settings of F2x[1, 0]9C_x[3:0]0[6:5][RdDqsTimeByte][7:0] obtained from DRAM training to values of 0Ch or less. Implementation of this workaround may have a nominal effect on DDR2-800 memory margins.",
        "status": "Yes"
    },
    "372": {
        "title": "Processor Read That Matches The Address of an Earlier Uncompleted Write May Be Incorrect",
        "problem": "Under highly specific and detailed internal timing conditions, processor data for a read may be corrupted when a read occurs that matches the address of an earlier uncompleted write or L3 eviction. This erratum applies only when both of the following conditions are satisfied on any processor node: • DRAM controllers are in DCT link unganged mode ([DRAM Controller Select Low Register] F2x110[DctGangEn] = 0b). • The northbridge current operating frequency (COF) is less than 3 times the memory clock frequency.",
        "implication": "Unpredictable system behavior.",
        "workaround": "On systems supporting DDR3-1333 or northbridge P-state 1, and using DCT link unganged mode, system software should set MSRC001_001F[52:51] to 11b.",
        "status": "No"
    },
    "373": {
        "title": "Processor Write to APIC Task Priority Register May Cause Error Status Bit to Set",
        "problem": "The processor may set Error Status Register[Send Accept Error] (APIC280[2]) after a write to a Task Priority Register (APIC080). This can occur only if a write to APIC080 follows a write to an Interrupt Command Register (APIC3[1, 0]0) that triggers an interprocessor interrupt (IPI). This erratum does not apply if the IPI message type set on APIC3[1, 0]0[10:8] is 011b (remote read), or if an L3 cache is present.",
        "implication": "Software may observe and report a false APIC error.",
        "workaround": "If an L3 cache is not present as indicated by CPUID Fn8000_0006_EDX[L3Size] (CPUID Fn8000_0006_EDX[31:18]) being equal to zero, system software should set MSRC001_001F[57] to 1b.",
        "status": "No"
    },
    "374": {
        "title": "Processor Read From L3 Cache May Return Stale Data",
        "problem": "Under highly specific and detailed internal timing conditions, a processor read from the L3 cache may return stale data.",
        "implication": "Unpredictable system behavior due to incorrect read data.",
        "workaround": "System software should set F3x1B8[18] to 1b.",
        "status": "Yes"
    },
    "378": {
        "title": "Processor May Operate at Reduced Frequency",
        "problem": "When Product Information Register F3x1FC[31] is set, the reset values of the P-State Registers (MSRC001_00[68:64]) are not compliant with prior algorithms used to specify the P-state frequencies. Only one P-state register has bit 63 (PstateEn) set and the CPU frequency specified by this P-State register is below the maximum operating frequency for the processor.",
        "implication": "AM3 package processors may experience performance degradation when installed in an AM2r2 or AM3 platform.",
        "workaround": "For AM3 package processors, when F3x1FC[31] is not set, the system designer must consult the AMD Family 10h Desktop Processor Power and Thermal Datasheet, order #43375 for correct single- plane TDP values. On AM2r2 and AM3 platforms, if F3x1FC[31] is set BIOS must follow the updated algorithm to write MSRC001_00[68:64] with corrected values, as documented in revision 3.23 or later versions of the BIOS and Kernel Developer’s Guide (BKDG) for AMD Family 10h Processors, order# 31116. This updated algorithm is applicable only to AM2r2 and AM3 platforms, and is incompatible with AM2 platforms.",
        "status": "No"
    },
    "379": {
        "title": "DDR3-1333 Configurations with Two DIMMs per Channel May Experience Unreliable Operation",
        "problem": "In systems with more than one DDR3-1333 unbuffered DIMM on a channel, the processor memory subsystem may exhibit unreliable operation over the allowable VDDIO voltage range. This erratum does not apply to DDR3-1333 configurations when only one DIMM per channel is populated.",
        "implication": "Memory system failure leading to unpredictable system behavior.",
        "workaround": "In a configuration where two unbuffered DDR3-1333 DIMMs are populated on one channel, BIOS should derate DDR3-1333 system memory to 533 MHz operation (DDR3-1066) by setting the DRAM Configuration High Register[MemClkFreq] (F2x[1, 0]94[2:0]) to 100b and adjusting memory subsystem timing parameters accordingly.",
        "status": "Yes"
    },
    "382": {
        "title": "L3 Cache Index Disable Cannot Be Modified After L3 Cache is Enabled",
        "problem": "The processor does not support the disabling of L3 indices using the L3 Cache Index Disable Registers (F3x[1C0, 1BC]) after the cache subsystem has been enabled (CR0[CD] = 0b).",
        "implication": "If software modifies F3x[1C0, 1BC] after the L3 cache has been enabled using CR0[CD], unpredictable system behavior may result.",
        "workaround": "None.",
        "status": "Yes"
    },
    "383": {
        "title": "CPU Core May Machine Check When System Software Changes Page Tables Dynamically",
        "problem": "If system software performs uncommon methods to change the page size of an active page table that is valid, the CPU core may, under a highly specific and detailed set of conditions, form duplicate TLB entries for a single linear address. The CPU core will machine check if this page is then accessed prior to it being invalidated from the TLB.",
        "implication": "Uncorrectable machine check exception for an L1 TLB Multimatch error. The MC0_STATUS register (MSR0000_0401) is B6000000_00010015h. Bit 62 (error overflow) of MC0_STATUS may or may not be set.",
        "workaround": "Affected software must ensure that page sizes are only increased or decreased after the entry is invalidated and flushed out of all TLBs. When flushing multiple entries from the TLB, software may wish to use a single MOV CR3 value to invalidate the TLB instead of repetitive INVLPG instructions. Additionally, hypervisors should ensure that the effects of a nested paging guest that exposes the condition is limited to the guest virtual machine with the following steps: 1. During hypervisor initialization, the hypervisor should set MSRC001_1022[47]. 2. The hypervisor should intercept machine-check exceptions (#MC) by setting VMCB offset 08h bit 12h. 3. When a VM_EXIT occurs with exit code 52h, the hypervisor must perform all the functions of a #MC exception handler. At a minimum, the hypervisor must clear MCi_STATUS registers and clear MCG_STAT[MCIP] (MSR0000_017A[2]). Failure to do so will result in a system shutdown in the event of a second machine check. 4. During the above process, the hypervisor should inspect the contents of MSR0000_0401 for the exact signature described in the Potential Effect on System. If the signature exists, then the hypervisor should abort the guest. 5. The hypervisor should flush the TLB. 6. The hypervisor should then resume operation.",
        "status": "No"
    },
    "384": {
        "title": "DRAM Prefetch May Cause System Hang When Probe Filter is Enabled",
        "problem": "When the processor is accessing memory with the probe filter and DRAM prefetch enabled, a DRAM prefetch may not complete.",
        "implication": "System hang.",
        "workaround": "System software should set the Memory Controller Configuration High[PrefIoDis, PrefCpuDis] (F2x11C[13:12] = 11b) if probe filter is enabled.",
        "status": "Yes"
    },
    "385": {
        "title": "Processor May Report Incorrect Address For an L3 Cache Error Machine Check",
        "problem": "The processor may report an incorrect address at NB Machine Check Address Register MSR0000_0412 when executing a machine check for an L3 cache error. In addition, when disabling an L3 cache index by writing to L3 Cache Index Disable Registers F3x[1C0, 1BC] [Index], the processor may not disable the intended L3 cache index.",
        "implication": "Operating system software may take inappropriate action due to an incorrectly reported L3 cache error.",
        "workaround": "System software should program F3x1B8[23] to 1b before enabling the L3 cache using CR0[30] (CD).",
        "status": "No"
    },
    "386": {
        "title": "HyperTransport™ Link in Retry Mode That Receives Repeated Invalid Packets May Cause MCA Exception",
        "problem": "Under highly specific and detailed internal timing conditions, a HyperTransport™ link in retry mode that receives repeated invalid packets in a specific sequence may cause the processor to generate a link data buffer overflow MCA exception. This erratum applies only when a link is configured as 16-bit ganged and the northbridge current operating frequency is less than the link clock frequency.",
        "implication": "System hang. A link data buffer overflow MCA exception will also be reported.",
        "workaround": "System software should program the Link Base Channel Buffer Count Registers F0x[F0, D0, B0, 90][27:25] (FreeData) to 000b to disable all free list link data buffers. To maximize system performance when applying this workaround on NFCM coherent links, system software should modify the settings for F0x[F0, D0, B0, 90] as specified in the BIOS and Kernel Developer’s Guide (BKDG) for AMD Family 10h Processors, order# 31116, per the following table: Register/Field NFCM Coherent Link Modified Setting FreeData 0 FreeCmd 8 RspData 3 NpReqData 2 ProbeCmd 8 RspCmd 9 PReq 3 NpReqCmd 4",
        "status": "Yes"
    },
    "387": {
        "title": "Performance Counters Do Not Accurately Count L3 Cache Evictions",
        "problem": "The processor does not report the correct count of L3 cache evictions when Performance Event Select Register (PERF_CTL[3:0]) MSRC001_000[3:0][EventSelect] is 4E3h. This erratum applies to all unit mask settings for this event.",
        "implication": "Performance monitoring software will not be able to count L3 cache evictions with this event counter.",
        "workaround": "Performance monitoring software can use EventSelect 0EAh, UnitMask 01h as an alternate method to count victim block writebacks.",
        "status": "No"
    },
    "388": {
        "title": "L3 Cache Scrubbing Does Not Bypass Disabled L3 Cache Locations",
        "problem": "The processor does not discontinue scrubbing L3 cache locations that are disabled using the L3 Cache Index Disable Registers F3x[1C0, 1BC].",
        "implication": "ECC errors that occur when scrubbing disabled L3 cache locations can generate unexpected machine check exceptions.",
        "workaround": "System software should program Scrub Rate Control Register F3x58[28:24] (L3Scrub) to 00000b before disabling any L3 cache locations. This workaround should not be applied when all L3 cache locations are enabled.",
        "status": "Yes"
    },
    "389": {
        "title": "HyperTransport™ Link in Retry Mode May Consume Link Packet Buffer Incorrectly",
        "problem": "Under highly specific and detailed internal timing conditions, a coherent HyperTransport™ link in retry mode that receives an invalid per-packet CRC may cause the processor to incorrectly consume a link packet buffer during link retry. This erratum applies only when F0x150[11:9] (HtRetryCrcDatIns) is set to a value other than 000b.",
        "implication": "System hang.",
        "workaround": "When CPUID Fn0000_0001_EAX[7:4] (Model) < 8, no workaround is required. For system developers that wish to provide a workaround for this event, system software may clear F0x150[11:9] (HtRetryCrcDatIns) to 000b. System software should clear F0x150[11:9] (HtRetryCrcDatIns) to 000b for all other affected processor revisions.",
        "status": "Yes"
    },
    "391": {
        "title": "HyperTransport™ Link RTT and RON Specification Violations",
        "problem": "The RTT and RON specifications of the HyperTransport™ link may be violated on some lanes.",
        "implication": "These violations do not result in any functional failures on HyperTransport™ links.",
        "workaround": "None.",
        "status": "No"
    },
    "393": {
        "title": "Performance Monitor May Count Fastpath Double Operation Instructions Incorrectly",
        "problem": "The processor does not report the correct count for all fastpath double operation instructions when Performance Event Select Register (PERF_CTL[3:0]) MSRC001_000[3:0][EventSelect] is 0CCh. This erratum applies to all unit mask settings for this event.",
        "implication": "Performance monitoring software will not have an accurate count of fastpath double operation instructions.",
        "workaround": "None.",
        "status": "No"
    },
    "395": {
        "title": "Incorrect Data Masking in Ganged DRAM Mode",
        "problem": "The DRAM controller may apply incorrect DRAM data masks when operating in ganged mode (DRAM Controller Select Low Register[DctGangEn] (F2x110[4]) is set to 1b).",
        "implication": "Unpredictable system behavior.",
        "workaround": "The DRAM controllers should only be configured in the unganged mode. BIOS should not set DRAM Controller Select Low Register[DctGangEn] (F2x110[4]). When only a single DCT is in use, DctGangEn is always zero.",
        "status": "Yes"
    },
    "396": {
        "title": "VLDT Maximum Current Specification Exceeded at HyperTransport™ Link Transfer Rates Up to 2.0 GT/s",
        "problem": "At HyperTransport™ link transfer rates up to 2.0 GT/s, VLDT maximum current (ILDT) may exceed the specified 500 mA per link limit.",
        "implication": "The processor may exceed the design of the power subsystem, resulting in over-current conditions that can lead to a shutdown or voltage droop.",
        "workaround": "For platforms that utilize Gen1 link transfer rates less than or equal to 2.0 GT/s, refer to the following documents for updated VLDT current specifications: • AMD Family 10h Server and Workstation Processor Power and Thermal Datasheet, order #43374 revision 3.07 or later • AMD Family 10h Desktop Processor Power and Thermal Datasheet, order #43375 revision 3.33 or later",
        "status": "No"
    },
    "397": {
        "title": "VLDT Maximum Current Specification Exceeded on HyperTransport™ Links in Retry Mode",
        "problem": "HyperTransport™ links in retry mode may exceed the 1.4 A per link VLDT maximum current (ILDT) specification.",
        "implication": "The processor may exceed the design of the power subsystem, resulting in over-current conditions that can lead to a shutdown or voltage droop.",
        "workaround": "Refer to the following document for updated VLDT current specifications: • AMD Family 10h Server and Workstation Processor Power and Thermal Datasheet, order #43374 revision 3.04 or later",
        "status": "No"
    },
    "398": {
        "title": "HyperTransport™ Links In Retry Mode May Experience High Bit Error Rate At Specific Link and Northbridge Clock Frequencies",
        "problem": "The processor HyperTransport™ link transmit FIFOs may underflow, resulting in bit errors. This erratum only applies when all of the following conditions are satisfied: • Links are in retry mode. • The HyperTransport link clock frequency is greater than the northbridge clock frequency. • The HyperTransport link clock frequency is an odd multiple of 200 MHz. • LDTSTOP# has not been asserted since the last warm reset.",
        "implication": "The link may fail to train due to multiple bit errors, or experience excessive retries. This behavior may be intermittent.",
        "workaround": "At link and northbridge frequency settings where the erratum applies, system software should subtract 0010b from the four bit value programmed into Link FIFO Read Pointer Optimization Registers F4x1[9C, 94, 8C, 84]_x[DF, CF][7:4] (XmtRdPtr). If the result of the subtraction is negative, truncate it to four bits of precision.",
        "status": "Yes"
    },
    "399": {
        "title": "Memory Clear Initialization May Not Complete if DCT0 Fails Training",
        "problem": "During DRAM initialization, memory clearing that is initiated by writing 1b to DRAM Controller Select Low Register F2x110[3] (MemClrInit) may fail to complete when all of the following conditions are true: • All DRAM connected to DCT0 is disabled by system software as a result of a DRAM training failure. • DRAM connected to DCT1 is successfully trained and enabled by system software. • DRAM Base System Address Register F1x120[20:0] (DramBaseAddr) is not programmed to 0 when MemClrInit is programmed to 1b.",
        "implication": "If DramBaseAddr is greater than or equal to the total DRAM size on DCT1 and the erratum conditions are satisfied, the system may fail to boot. If DramBaseAddr is less than the total DRAM size on DCT1 and the erratum conditions are satisfied, memory clear initialization will not clear all memory locations on DCT1. If ECC is enabled, this may result in unexpected ECC errors occurring on uninitialized memory.",
        "workaround": "No workaround required if system software skips memory clear initialization and does not use memory on a node when any memory training errors have been reported on that node. System software developers that wish to use memory clear initialization regardless of memory training error status should program DramBaseAddr to 0 before programming MemClrInit to 1b. After completion of memory clear initialization, system software should restore the original value of DramBaseAddr.",
        "status": "No"
    },
    "400": {
        "title": "APIC Timer Interrupt Does Not Occur in Processor C-States",
        "problem": "An APIC timer interrupt that becomes pending in low-power states C1E or C3 will not cause the processor to enter the C0 state even if the interrupt is enabled by Timer Local Vector Table Entry[Mask], APIC320[16]). APIC timer functionality is otherwise unaffected.",
        "implication": "System hang may occur provided that the operating system has not configured another interrupt source. APIC timer interrupts may be delayed or, when the APIC timer is configured in rollover mode (APIC320[17]), the APIC timer may roll over multiple times in the low-power state with only one interrupt presented after the processor resumes. The standard use of the APIC timer does not make this effect significant.",
        "workaround": "Operating system software should enable another source of timer interrupts, such as the High Precision Event Timer, before it enters the C1 state by executing the HLT instruction and C1E is enabled using Interrupt Pending and CMP-Halt Register[C1eOnCmpHalt or SmiOnCmpHalt] (MSRC001_0055[28:27] are not 00b). For purposes of determining if C1E is enabled, the operating system should not sample MSRC001_0055 until after ACPI has been enabled. Operating system software should enable another source of timer interrupts, such as the High Precision Event Timer, when the processor enters the C3 state. It is possible for the system to implement a hardware fix to C1E mode on some processor revisions and some packages. This is indicated by OSVW[1] and no workaround is necessary when OSVW_Length >= 2 and OSVW[1] is zero. Due to erratum #669, a similar workaround may be required even when OSVW[1] = 0b. An operating system workaround for C3 mode is always necessary, regardless of the setting of OSVW[1].",
        "status": "C1E state: Yes C3 state: No"
    },
    "405": {
        "title": "HyperTransport™ Link May Fail to Complete Training",
        "problem": "HyperTransport™ links may fail to re-train when resuming from LS2 low-power mode or following a warm reset. The failure may be package-specific and sensitive to longer HyperTransport links that contain multiple connectors.",
        "implication": "System hang.",
        "workaround": "On G34r1 and C32r1 processors, system software should program the Link Global Extended Register[RXCalEn] (F0x16C[9]) to 1b. For Fr5 (1207) and Fr6 (1207) processors, system developers that observe the erratum conditions following warm reset should program the Link Global Extended Register[RXCalEn] (F0x16C[9]) to 1b. For all other processors, system software may program the Link Global Extended Register[RXCalEn] (F0x16C[9]) to 1b. This workaround is not necessary if erratum #351 applies to the processor revision.",
        "status": "No"
    },
    "406": {
        "title": "Processor Does Not Perform BmStsClrOnHltEn Function",
        "problem": "The processor does not perform a write operation to clear the BM_STS bit when Interrupt Pending and CMP-Halt Register[BmStsClrOnHltEn] (MSRC001_0055[29]) is set.",
        "implication": "The ACPI-defined register BM_STS bit may not be cleared before entry into C1E mode. This does not cause functional issues but may reduce the power saving effectiveness of message-triggered C1E mode.",
        "workaround": "Contact your AMD representative for information on a BIOS update.",
        "status": "Yes"
    },
    "407": {
        "title": "System May Hang Due to Stalled Probe Data Transfer",
        "problem": "Under highly detailed and specific internal timing conditions, a processor that has one or more processor cores in a cache-flushed state following a C1E exit, and one or more cores executing in C0 state, may not complete a data transfer for a probe.",
        "implication": "System hang.",
        "workaround": "Contact your AMD representative for information on a BIOS update. This workaround requires that Clock Power/Timing Control 2 Register[CacheFlushOnHaltTmr] (F3xDC[25:19]) is greater than 01h, which is true under normal circumstances.",
        "status": "Yes"
    },
    "408": {
        "title": "Processor AltVID Exit May Cause System Hang",
        "problem": "Under highly detailed and specific internal timing conditions, the processor may hang during an exit from the AltVID state.",
        "implication": "System hang.",
        "workaround": "System software should set Clock Power/Timing Control 0 Register[NbClkDiv] (F3xD4[30:28]) to 100b.",
        "status": "No"
    },
    "411": {
        "title": "Processor May Exit Message-Triggered C1E State Without an Interrupt if Local APIC Timer Reaches Zero",
        "problem": "If the processor is in the message-triggered C1E state with local APIC Timer Initial Count Register (APIC380[31:0]) non-zero, and the Timer Current Count Register (APIC390[31:0]) transitions to 0, the processor will assert IDLEEXIT_L to request an exit from C1E even if the APIC timer interrupt is masked (Timer Local Vector Table Entry[Mask] (APIC320[16]) is 1b). If the timer interrupt is masked, the processor then enters the C1 state without an interrupt pending.",
        "implication": "This does not cause functional issues but may reduce the power saving effectiveness of message- triggered C1E mode. This would normally occur only if an operating system that has used the local APIC timer masks the interrupt without stopping the counter using the Timer Initial Count Register.",
        "workaround": "When programming APIC320[Mask] to 1b to mask the local APIC timer interrupt, operating system software should program APIC380[31:0] to 0.",
        "status": "No"
    },
    "414": {
        "title": "Processor May Send Mode Register Set Commands to DDR3 DIMM Incorrectly",
        "problem": "The processor may send a Mode Register Set (MRS) command to a DDR3 DIMM without satisfying the auto-refresh row cycle time programmed at the DRAM Timing High Register F2x[1, 0]8C. In addition, the processor may send an MRS command to a DDR3 DIMM that has an active bank. This erratum applies only when DRAM Configuration High Register F2x[1, 0]94[15] (PowerDownEn) is programmed to 1b, F2x[1, 0]94[Ddr3Mode] is programmed to 1b, and DRAM MRS Register F2x[1, 0]84[23] (PchgPDModeSel) is programmed to 1b.",
        "implication": "For systems without ECC, undefined system behavior that usually results in a system hang. Systems with ECC enabled may experience repeated multiple-bit ECC errors.",
        "workaround": "System software should program F2x[1, 0]84[23] (PchgPDModeSel) to 0b.",
        "status": "No"
    },
    "415": {
        "title": "HLT Instructions That Are Not Intercepted May Cause System Hang",
        "problem": "In guest mode when VMCB.V_INTR_MASK flag is 1b, the processor may not process host interrupts if a guest executes a HLT instruction that is not intercepted.",
        "implication": "System hang.",
        "workaround": "Hypervisors should intercept HLT instructions by setting VMCB.Intercept_HLT (offset 00Ch bit 24) to 1b.",
        "status": "No"
    },
    "416": {
        "title": "DRAM Error Injection May Interfere With Power Management Events",
        "problem": "The value in the NB Array Address Register (F3xB8) may change during a stop-clock throttling event, C1E entry or C3 entry. In addition, a non-zero value in F3xB8 may cause a failure during stop-clock throttling or C1E or C3 mode entry.",
        "implication": "Unpredictable system behavior.",
        "workaround": "Diagnostic software should ensure that all power management events are disabled during a DRAM error injection and should restore F3xB8 to zero before resuming these power management functions.",
        "status": "No"
    },
    "417": {
        "title": "Processor May Violate Tstab for Registered DDR3-1333 DIMMs",
        "problem": "Prior to asserting CKE during self-refresh exit, the processor may not provide a stable MEMCLK for the DIMM Tstab period of 6 microseconds. While MEMCLK is running for over 6 microseconds, one or more missing pulses may exist. The processor provides at least 4.2 microseconds of stable MEMCLK in DDR3-1333 mode, and has no violation at all lower MEMCLK frequencies. This violation only applies to registered DDR3-1333 operation only. This violation does not occur during DRAM initialization. It may occur only when the system exits DRAM self-refresh mode when DLL shutdown is enabled (DRAM Configuration Low Register[DisDllShutdown] (F2x[1,0]90[27]) is 0b).",
        "implication": "No adverse issues have been observed. If a DDR3 DIMM is sensitive to this issue, the system may fail to exit self-refresh.",
        "workaround": "None required.",
        "status": "No"
    },
    "418": {
        "title": "Host Mapping of Physical Page Zero May Cause Incorrect Translation",
        "problem": "Under highly specific and detailed architectural conditions, the processor may use an incorrect cached copy of translation tables during a SVM nested page translation. This condition requires that the host be in legacy physical address extension (PAE) mode and that the guest address translation tables reside in physical page zero.",
        "implication": "Unpredictable system behavior. This condition has not been observed in any commercially available software.",
        "workaround": "Hypervisor software should not use physical addresses 0 through 4095 for guest pages.",
        "status": "No"
    },
    "419": {
        "title": "C32r1 Package Processor May Report Incorrect PkgType",
        "problem": "A processor in a C32r1 package may report an incorrect PkgType of 0001b in CPUID Fn8000_0001_EBX[31:28]. This is the package type encoding for AM2r2/AM3 packages instead of the correct C32r1 package type encoding of 0101b.",
        "implication": "Software may incorrectly report the package type and incorrectly initialize package-specific features.",
        "workaround": "Contact your AMD representative for information on a BIOS update.",
        "status": "Yes"
    },
    "420": {
        "title": "Instruction-Based Sampling Engine May Generate Interrupt that Cannot Be Cleared",
        "problem": "A micro-op that is tagged by the Instruction-Based Sampling (IBS) execution engine shortly before the software clears the IBS Execution Control Register[IbsOpEn] (MSRC001_1033[17]) may create a condition in which the IBS sampling engine continuously generates an interrupt. This condition can exist even if IBS is not re-enabled.",
        "implication": "Processor core may not make forward progress, usually resulting in a system crash or hang.",
        "workaround": "To disable the IBS execution sampling engine, software should first clear IbsOpMaxCnt to 0000h without changing IbsOpEn (write MSRC001_1033 to 00000000_00020000h). After IbsOpMaxCnt is set to zero, software should then perform a second write to clear IbsOpEn.",
        "status": "No"
    },
    "421": {
        "title": "Performance Monitors for Fence Instructions May Increment Due to Floating-Point Instructions",
        "problem": "The processor may increment the count for LFENCE, SFENCE or MFENCE instructions (Performance Event Select Register (PERF_CTL[3:0]) MSRC001_000[3:0][EventSelect] is 1D3h, 1D4h or 1D5h respectively) when unrelated floating-point operations are executed.",
        "implication": "Performance monitoring software will not have an accurate count of LFENCE, SFENCE, or MFENCE instructions.",
        "workaround": "None.",
        "status": "No"
    },
    "437": {
        "title": "L3 Cache Performance Events May Not Reliably Track Processor Core",
        "problem": "The following L3 cache performance events may increment for events caused by cores that are not being tracked and may not increment for events caused by cores that are being tracked. • F4x1C8 L3 Hit Statistics Register. • EventSelect 4E0h Read Request to L3 Cache when the unit mask is not Fxh. • EventSelect 4E1h L3 Cache Misses when the unit mask is not Fxh. • EventSelect 4E2h L3 Fills caused by L2 Evictions when the unit mask is not Fxh. • EventSelect 4EDh Non-cancelled L3 Read Requests when the unit mask is not Fxh.",
        "implication": "Performance monitoring software may not have an accurate count of the L3 cache accesses caused by a specific program.",
        "workaround": "No workaround exists for F4x1C8. For other performance events, software should use the unit mask setting of Fxh. This setting selects all processor cores. There is no method to track the L3 cache accesses from a single core.",
        "status": "No"
    },
    "438": {
        "title": "Access to MSRC001_0073 C-State Base Address Results in a #GP Fault",
        "problem": "An access to MSRC001_0073 C-State Base Address will result in a #GP fault.",
        "implication": "BIOS that attempts to enable an I/O C-state will generate an exception.",
        "workaround": "Contact your AMD representative for information on a BIOS update.",
        "status": "No"
    },
    "439": {
        "title": "DQS Receiver Enable Training May Find Incorrect Delay Value",
        "problem": "Under highly specific and internal conditions, the algorithm for DQS Receiver Enable Training may incorrectly place the delay value for the DRAM DQS Receiver Enable Timing Control Register F2x[1,0]9C_x[2B:10] before the read preamble. The conditions under which this erratum may be observed are sensitive to platform memory configurations and the timing between successive training data reads.",
        "implication": "When the DQS Receiver Enable delay is placed before the read preamble, later DQS Position Training failures will result in the DIMM being reported in error due to a training failure. The DIMM may be removed from the configuration.",
        "workaround": "Contact your AMD representative for information on a BIOS update.",
        "status": "No"
    },
    "440": {
        "title": "SMM Save State Host CR3 Value May Be Incorrect",
        "problem": "The processor writes bits 47:32 as 0000h of SMM Save State offset FF38h (Host CR3) when all of the following conditions are met: • An SMI occurs while in a guest context. • SMIs are not intercepted to the hypervisor and cause a direct transition from the guest to the SMM code. • Nested paging is in use (VMCB offset 090h[0], NP_ENABLE, is 1b). • The SVM Host CR3 address is greater than 4GB (VMCB Offset 0B0h, N_CR3, bits 47:32 are non-zero). • Guest is not in long mode at the time of the SMI (guest Extended Feature Enable Register EFER[Long Mode Enable], MSRC000_0080[8], is 0b). After the SMM BIOS executes an RSM instruction, the processor may then use this incorrect host CR3 for guest operation.",
        "implication": "Unpredictable system operation.",
        "workaround": "Contact your AMD representative for information on a BIOS update.",
        "status": "No"
    },
    "441": {
        "title": "Move from Stack Pointer to Debug or Control Register May Result in Incorrect Value",
        "problem": "A move from the stack pointer to a debug register or a control register may store a value that does not include one or more updates based on completed pushes, pops, near calls or returns. This erratum does not occur if the instruction encoding uses the standard encoding of ModRM[7:6]=11b to indicate a register-to-register move.",
        "implication": "None expected based on the ModRM[7:6] normally being 11b.",
        "workaround": "Always encode ModRM[7:6]=11b when performing a move into a debug or control register.",
        "status": "No"
    },
    "443": {
        "title": "Instruction-Based Sampling May Not Indicate Store Operation",
        "problem": "Instruction-Based Sampling (IBS) tagging on certain micro-ops that perform both the load and store operation may only set the IBS Op Data 3 Register[IbsLdOp] (MSRC001_1037[0]) and not IBS Op Data 3 Register[IbsStOp] (MSRC001_1037[1]).",
        "implication": "Inaccuracies in performance monitoring software may be experienced.",
        "workaround": "None.",
        "status": "No"
    },
    "459": {
        "title": "DDR3-1333 Configurations with Three DIMMs per Channel May Experience Unreliable Operation",
        "problem": "In systems with three DDR3-1333 registered DIMMs on a channel, the processor memory subsystem may exhibit unreliable operation over the allowable voltage ranges.",
        "implication": "Memory system failure, leading to DRAM ECC machine check errors.",
        "workaround": "In a configuration where three registered DDR3-1333 DIMMs are populated on one channel, BIOS should de-rate DDR3-1333 system memory to 533 MHz operation (DDR3-1066) by setting the DRAM Configuration High Register[MemClkFreq] (F2x[1, 0]94[2:0]) to 100b and adjusting memory subsystem timing parameters accordingly.",
        "status": "No"
    },
    "486": {
        "title": "Processor Thermal Data Sheet Specification Error",
        "problem": "The AMD Family 10h Server and Workstation Processor Power and Thermal Data Sheet, order #43374 for G34r1 and C32r1 OPNs incorrectly documented an “IDD Max” value that was based on current at “Thermal Design Power” (TDP). The maximum current for these processors would be properly defined at “MaxPower” and documented as the “Thermal Design Current” (TDC).",
        "implication": "None.",
        "status": "Consult the updated AMD Family 10h Server and Workstation Processor Power and Thermal Data Sheet, order# 43374 revision 3.19 or later for corrected values, now listed as TDC.",
        "workaround": "<No field for `workaround`>"
    },
    "521": {
        "title": "C1E Resume Failure With Certain Registered DIMM Configurations",
        "problem": "Processors may fail to exit self-refresh mode under the following conditions: • LDTSTOP# is asserted less than 20 uS after it was last deasserted. • The system configuration includes a processor node having dual or quad rank DDR3 Registered DIMMs on one channel and only single rank or no DIMMs on the other channel. • The DRAM Configuration Register[MemClkFreq] (F2x94[2:0]) is 100b (DDR3-667) on the aforementioned processor node. • Message-triggered C1E is enabled (Clock Power/Timing Control 0 Register[MTC1eEn], F3xD4[13] = 1b).",
        "implication": "System hang.",
        "workaround": "System BIOS should program the minimum LDTSTOP# deassertion time to 20 uS. For systems using a SP5100 southbridge, this is accomplished by setting the southbridge LDTStartTime register (PM_Reg:88h) = 14h.",
        "status": "No"
    },
    "550": {
        "title": "Latency Performance Counters Are Not Accurate",
        "problem": "Latency performance counters MSRC001_000[3:0][7:0] (EventSelect) in the range 1E2h to 1E7h are not accurate when L3 speculative miss prefetching is enabled (F2x1B0[13] = 0b, Extended Memory Controller Configuration Low[SpecPrefDis]).",
        "implication": "Performance monitoring software cannot accurately measure latency events. The reported latency may greatly exceed the actual latency in some instances.",
        "workaround": "No workaround is recommended. Performance monitoring code may set F2x1B0[13] = 1b to collect accurate latency values. This workaround has an impact to overall system performance.",
        "status": "No"
    },
    "610": {
        "title": "Processor with Message-Triggered C1E Enabled May Report a False L3 LRU or Tag Machine Check",
        "problem": "During an exit from message-triggered C1E state (LDTSTOP# deassertion) that is less than 10 microseconds after the STOPGRANT message, the processor may report a false uncorrectable machine check exception for either an L3 LRU or tag error. The false machine check is due to an L3 stutter scrub happening while the L3 clocks are disabled. L3 stutter scrubs are enabled when Clock Power/Timing Control 0 Register[StutterScrubEn] (F3xD4[15]) is 1b, and BIOS enables this only when message-triggered C1E is enabled. This erratum is exposed only when the minimum time from STOPGRANT message to LDTSTOP# deassertion is violated. However, erratum #669 documents an additional circumstance under which a similar condition may be observed even when the minimum time from STOPGRANT message to LDTSTOP# deassertion is not violated. The BIOS and Kernel Developer’s Guide (BKDG) for AMD Family 10h Processors, order# 31116 documents a minimum time of 16 microseconds between these events.",
        "implication": "Uncorrectable machine check exception (#MC) for an L3 LRU or tag error. The MC4_STATUS register (MSR0000_0411) is either FCxx21x0_001D010B or FCxx21x0_001E010B. Bit 62 (error overflow) and bits 43:42 (L3 subcache) of MC4_STATUS may or may not be set. This machine check also causes a sync flood and reboot, unless these mechanisms have been disabled.",
        "workaround": "BIOS should set F3x1B8[5] = 1b whenever message-triggered C1E is enabled (Clock Power/Timing Control 0 Register[MTC1eEn], F3xD4[13] = 1b) to remove the conditions under which the improper scrub can occur. Implementation of this workaround does not alter the required minimum time from STOPGRANT message to LDTSTOP# deassertion.",
        "status": "No"
    },
    "625": {
        "title": "SB-RMI Writes May Not Be Observed by Processor",
        "problem": "After a write using the APML SB-RMI interface to either the Inbound Message Registers (SBRMI_x3[F:8]) or Software Interrupt Register (SBRMI_x40), the processor may observe the previous contents (as if the write did not occur) when reading these same registers using the SBI Address/Data registers (F3x1E8 and F3x1EC). The conditions under which this erratum may occur requires that message-triggered C1E is enabled (F3xD4[13] = 1b, Clock Power/Timing Control 0[MTC1eEn]). The functionality of the SB-RMI interface is not otherwise affected.",
        "implication": "Software running on the processor is not able to properly receive messages from system management software using the SB-RMI interface.",
        "workaround": "None. In the event that system management software needs to communicate with software running on the processor, an alternative mechanism should be used.",
        "status": "No"
    },
    "643": {
        "title": "Processor May Increment CPU Watchdog Timer at an Incorrect Rate",
        "problem": "The rate at which the CPU watchdog timer counter increments may be significantly higher than the rate specified in the CPU Watchdog Timer Register[CpuWdtCountSel, CpuWdtCountBase] (MSRC001_0074[6:3 and 2:1]).",
        "implication": "The CPU watchdog timer, if enabled, may report a machine check earlier than the northbridge watchdog timer, possibly leading to incorrect failure analysis on the cause of a hang. While the CPU watchdog timer may expire at a faster rate, the increased rate is not expected to lead to a false machine check.",
        "workaround": "BIOS should not enable the CPU watchdog timer. MSRC001_0074[CpuWdtEn, bit 0] should remain at its reset value of 0b.",
        "status": "No"
    },
    "669": {
        "title": "Local Vector Table Interrupt May Cause C1E Entry Without Caches Flushed",
        "problem": "An interrupt assigned to the APIC local vector table (LVT) that becomes pending in a short interval around entry to C1E mode may cause the processor to incorrectly enter C1E mode after storing the interrupt vector but before executing the first instruction of the interrupt handler. When this occurs, the processor is in C1E mode while the processor caches are not flushed. I/O activity that occurs while in C1E mode may cause additional and unexpected core clock frequency changes in order to probe these caches. A short LDTSTOP# assertion time may create a condition where the processor cores are still performing clock frequency changes when LDTSTOP# is de- asserted, even when the LDTSTOP# assertion time is greater than the minimum required assertion time. The interrupt handler for this LVT interrupt is only processed after the processor exits C1E mode for another interrupt.",
        "implication": "A system hang may be observed if the operating system enters C1 state (by execution of the HLT instruction) with only a one-shot APIC timer interrupt configured, since the processor is in C1E state until another interrupt occurs. A system hang has not been observed in silicon. The standard use of these interrupts, including the APIC timer, does not expose this effect. LVT interrupts may be delayed while the processor is in C1E low-power state. The standard use of these interrupts, including the APIC timer, does not make this effect significant. In addition, if LDTSTOP# is de-asserted while the processor is performing additional and unexpected core clock frequency changes due to the additional cache probing caused by this erratum, the conditions described in erratum #610 may be observed. Unless the BIOS or system software has applied the suggested workaround of erratum #610 (i.e. F3x1B8[5] is 0b), then the processor may generate an uncorrectable machine check exception (#MC) and a possible sync flood due to a falsely reported L3 LRU or tag error. Refer to erratum #610 for the MC4_STATUS signature of this machine check.",
        "workaround": "Contact your AMD representative for information on a BIOS update. Implementing this workaround does not alter the minimum LDTSTOP# assertion time.",
        "status": "No"
    },
    "670": {
        "title": "Segment Load May Cause System Hang or Fault After State Change",
        "problem": "Under a highly specific and detailed set of conditions, a segment load instruction may cause a failure in one of the following instructions later in the instruction stream: • BTC mem, imm8 • BTC mem, reg • BTR mem, imm8 • BTR mem, reg • BTS mem, imm8 • BTS mem, reg • RCL mem, cl • RCL mem, imm • RCR mem, cl • RCR mem, imm • SHLD mem, reg, imm • SHLD mem, reg, cl • SHRD mem, reg, imm • SHRD mem, reg, cl • XCHG mem, reg (uses an implicit LOCK prefix) • XCHG reg, mem (uses an implicit LOCK prefix) • Any instruction with an explicit LOCK prefix in the instruction opcode.",
        "implication": "For affected instructions that have an implicit or explicit LOCK prefix, a system hang occurs. For affected instructions that do not have an implicit or explicit LOCK prefix, the processor may present a #PF exception after some of the instruction effects have been applied to the processor state. No system effect is observed unless the page fault handler has some dependency on this interim processor state, which is not the case in any known operating system software. This interim state does not affect the ability for the operating system to handle the #PF and resume the instruction without impact to the program. However, this interim state may be observed by a debugger or if the operating system changes the #PF to a program error (for example, a segmentation fault).",
        "workaround": "System software should set MSRC001_1020[8] = 1b. †This workaround ensures that instructions with an implicit or explicit LOCK prefix do not cause a system hang due to this erratum. However, instructions may still present a #PF after altering architectural state.",
        "status": "No"
    }
}