{
    "SKL001": {
        "title": "Reported Memory Type May Not Be Used to Access the VMCS and Referenced Data Structures",
        "problem": " Bits 53:50 of the IA32_VMX_BASIC MSR report the memory type that the processor uses to access the VMCS and data structures referenced by pointers in the VMCS. Due to this erratum, a VMX access to the VMCS or referenced data structures will instead use the memory type that the MTRRs (memory-type range registers) specify for the physical address of the access.",
        "implication": "Bits 53:50 of the IA32_VMX_BASIC MSR report that the WB (write-back) memory type will be used but the processor may use a different memory type.",
        "workaround": "Software should ensure that the VMCS and referenced data structures are located at physical addresses that are mapped to WB memory type by the MTRRs.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL002": {
        "title": "Instruction Fetch May Cause Machine Check if Page Size and Memory Type Was Changed Without Invalidation",
        "problem": " This erratum may cause a machine-check error (IA32_MCi_STATUS.MCACOD=0150H) on the fetch of an instruction that crosses a 4- KByte address boundary. It applies only if (1) the 4-KByte linear region on which the instruction begins is originally translated using a 4-KByte page with the WB memory type; (2) the paging structures are later modified so that linear region is translated using a large page (2-MByte, 4-MByte, or 1-GByte) with the UC memory type; and (3) the instruction fetch occurs after the paging-structure modification but before software invalidates any TLB entries for the linear region.",
        "implication": " Due to this erratum an unexpected machine check with error code 0150H may occur, possibly resulting in a shutdown. Intel has not observed this erratum with any commercially available software.",
        "workaround": " Software should not write to a paging-structure entry in a way that would change, for any linear address, both the page size and the memory type. It can instead use the following algorithm: first clear the P flag in the relevant paging-structure entry (e.g., PDE); then invalidate any translations for the affected linear addresses; and then modify the relevant paging-structure entry to set the P flag and establish the new page size and memory type.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL003": {
        "title": "Execution of VAESIMC or VAESKEYGENASSIST With An Illegal Value for VEX.vvvv May Produce a #NM Exception",
        "problem": " The VAESIMC and VAESKEYGENASSIST instructions should produce a #UD (Invalid- Opcode) exception if the value of the vvvv field in the VEX prefix is not 1111b. Due to this erratum, if CR0.TS is “1”, the processor may instead produce a #NM (Device- Not-Available) exception.",
        "implication": "Due to this erratum, some undefined instruction encodings may produce a #NM instead of a #UD exception.",
        "workaround": "Software should always set the vvvv field of the VEX prefix to 1111b for instances of the VAESIMC and VAESKEYGENASSIST instructions.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL004": {
        "title": "The Corrected Error Count Overflow Bit in IA32_ MC0_STATUS is Not Updated When The UC Bit is Set",
        "problem": " After a UC (uncorrected) error is logged in the IA32_MC0_STATUS MSR (401H), corrected errors will continue to be counted in the lower 14 bits (bits 51:38) of the Corrected Error Count. Due to this erratum, the sticky count overflow bit (bit 52) of the Corrected Error Count will not get updated when the UC bit (bit 61) is set to 1.",
        "implication": "The Corrected Error Count Overflow indication will be lost if the overflow occurs after an uncorrectable error has been logged.",
        "workaround": "None identified",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL005": {
        "title": "VM Exit May Set IA32_EFER.NXE When IA32_MISC_ENABLE Bit 34 is Set to 1",
        "problem": " When “XD Bit Disable” in the IA32_MISC_ENABLE MSR (1A0H) bit 34 is set to 1, it should not be possible to enable the “execute disable” feature by setting IA32_EFER.NXE. Due to this erratum, a VM exit that occurs with the 1-setting of the “load IA32_EFER” VM-exit control may set IA32_EFER.NXE even if IA32_MISC_ENABLE bit 34 is set to 1. This erratum can occur only if IA32_MISC_ENABLE bit 34 was set by guest software in VMX non-root operation.",
        "implication": " Software in VMX root operation may execute with the “execute disable” feature enabled despite the fact that the feature should be disabled by the IA32_MISC_ENABLE MSR. Intel has not observed this erratum with any commercially available software.",
        "workaround": "A virtual-machine monitor should not allow guest software to write to the IA32_MISC_ENABLE MSR",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL006": {
        "title": "SMRAM State-Save Area Above the 4GB Boundary May Cause Unpredictable System Behavior",
        "problem": " If BIOS uses the RSM instruction to load the SMBASE register with a value that would cause any part of the SMRAM state-save area to have an address above 4-GBytes, subsequent transitions into and out of SMM (system-management mode) might save and restore processor state from incorrect addresses.",
        "implication": "This erratum may cause unpredictable system behavior. Intel has not observed this erratum with any commercially available system.",
        "workaround": "Ensure that the SMRAM state-save area is located entirely below the 4GB address boundary.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL007": {
        "title": "Pending x87 FPU Exceptions (#MF) May be Signaled Earlier Than Expected",
        "problem": " x87 instructions that trigger #MF normally service interrupts before the #MF. Due to this erratum, if an instruction that triggers #MF is executing when an Enhanced Intel SpeedStep® Technology transitions, an Intel® Turbo Boost Technology transitions, or a Thermal Monitor event occurs, the #MF may be taken before pending interrupts are serviced.",
        "implication": "Software may observe #MF being signaled before pending interrupts are serviced.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL008": {
        "title": "Incorrect FROM_IP Value For an RTM Abort in BTM or BTS May be Observed",
        "problem": " During RTM (Restricted Transactional Memory) operation when branch tracing is enabled using BTM (Branch Trace Message) or BTS (Branch Trace Store), the incorrect EIP value (From_IP pointer) may be observed for an RTM abort.",
        "implication": "Due to this erratum, the From_IP pointer may be the same as that of the immediately preceding taken branch.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL009": {
        "title": "DR6 Register May Contain an Incorrect Value When a MOV to SS or POP SS Instruction is Followed by an XBEGIN Instruction",
        "problem": " If XBEGIN is executed immediately after an execution of MOV to SS or POP SS, a transactional abort occurs and the logical processor restarts execution from the fallback instruction address. If execution of the instruction at that address causes a debug exception, bits [3:0] of the DR6 register may contain an incorrect value.",
        "implication": " When the instruction at the fallback instruction address causes a debug exception, DR6 may report a breakpoint that was not triggered by that instruction, or it may fail to report a breakpoint that was triggered by the instruction.",
        "workaround": "Avoid following a MOV SS or POP SS instruction immediately with an XBEGIN instruction.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL010": {
        "title": "Opcode Bytes F3 0F BC May Execute As TZCNT Even When TZCNT Not Enumerated by CPUID",
        "problem": " If CPUID.(EAX=07H, ECX=0):EBX.BMI1 (bit 3) is 1 then opcode bytes F3 0F BC should be interpreted as TZCNT otherwise they will be interpreted as REP BSF. Due to this erratum, opcode bytes F3 0F BC may execute as TZCNT even if CPUID.(EAX=07H, ECX=0):EBX.BMI1 (bit 3) is 0.",
        "implication": " Software that expects REP prefix before a BSF instruction to be ignored may not operate correctly since there are cases in which BSF and TZCNT differ with regard to the flags that are set and how the destination operand is established.",
        "workaround": " Software should use the opcode bytes F3 0F BC only if CPUID.(EAX=07H, ECX=0):EBX.BMI1 (bit 3) is 1 and only if the functionality of TZCNT (and not BSF) is desired.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL011": {
        "title": "PCIe* Root-port Initiated Compliance State Transmitter Equalization Settings May be Incorrect",
        "problem": " If the processor is directed to enter PCIe Polling.Compliance at 5.0 GT/s or 8.0 GT/s transfer rates, it should use the Link Control 2 Compliance Preset/De-emphasis field (bits [15:12]) to determine the correct de-emphasis level. Due to this erratum, when the processor is directed to enter Polling.Compliance from 2.5 GT/s transfer rate, it retains 2.5 GT/s de-emphasis values.",
        "implication": "The processor may operate in Polling.Compliance mode with an incorrect transmitter de-emphasis level.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL012": {
        "title": "The SMSW Instruction May Execute Within an Enclave",
        "problem": " The SMSW instruction is illegal within an SGX (Software Guard Extensions) enclave, and an attempt to execute it within an enclave should result in a #UD (invalid-opcode exception). Due to this erratum, the instruction executes normally within an enclave and does not cause a #UD.",
        "implication": "The SMSW instruction provides access to CR0 bits 15:0 and will provide that information inside an enclave. These bits include NE, ET, TS, EM, MP and PE.",
        "workaround": "None identified. If SMSW execution inside an enclave is unacceptable, system software should not enable SGX.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL013": {
        "title": "PEBS Record After a WRMSR to IA32_BIOS_UPDT_TRIG May be Incorrect",
        "problem": " A PEBS record generated by a WRMSR to IA32_BIOS_UPDT_TRIG MSR (79H) may have an incorrect value in the Eventing EIP field if an instruction prefix was used on the WRMSR.",
        "implication": "The Eventing EIP field of the generated PEBS record may be incorrect. Intel has not observed this erratum with any commercially available software.",
        "workaround": "Instruction prefixes have no architecturally-defined function for the WRMSR instruction; instruction prefixes should not be used with the WRMSR instruction.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL014": {
        "title": "Intel® PT TIP.PGD May Not Have Target IP Payload",
        "problem": " When Intel PT (Intel Processor Trace) is enabled and a direct unconditional branch clears IA32_RTIT_STATUS.FilterEn (MSR 571H, bit 0), due to this erratum, the resulting TIP.PGD (Target IP Packet, Packet Generation Disable) may not have an IP payload with the target IP.",
        "implication": "It may not be possible to tell which instruction in the flow caused the TIP.PGD using only the information in trace packets when this erratum occurs.",
        "workaround": "The Intel PT trace decoder can compare direct unconditional branch targets in the source with the FilterEn address range(s) to determine which branch cleared FilterEn.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL015": {
        "title": "Operand-Size Override Prefix Causes 64-bit Operand Form of MOVBE Instruction to Cause a #UD",
        "problem": "Execution of a 64 bit operand MOVBE instruction with an operand-size override instruction prefix (66H) may incorrectly cause an invalid-opcode exception (#UD).",
        "implication": " A MOVBE instruction with both REX.W=1 and a 66H prefix will unexpectedly cause an #UD (invalid-opcode exception). Intel has not observed this erratum with any commercially available software.",
        "workaround": "Do not use a 66H instruction prefix with a 64-bit operand MOVBE instruction.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL016": {
        "title": "Execution of FXSAVE or FXRSTOR With the VEX Prefix May Produce a #NM Exception",
        "problem": " Attempt to use FXSAVE or FXRSTOR with a VEX prefix should produce a #UD (Invalid-Opcode) exception. If either the TS or EM flag bits in CR0 are set, a #NM (device-not-available) exception will be raised instead of #UD exception.",
        "implication": "Due to this erratum a #NM exception may be signaled instead of a #UD exception on an FXSAVE or an FXRSTOR with a VEX prefix.",
        "workaround": "Software should not use FXSAVE or FXRSTOR with the VEX prefix.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL017": {
        "title": "WRMSR May Not Clear The Sticky Count Overflow Bit in The IA32_MCi_STATUS MSRs’ Corrected Error Count Field",
        "problem": " The sticky count overflow bit is the most significant bit (bit 52) of the Corrected Error Count Field (bits[52:38]) in IA32_MCi_STATUS MSRs. Once set, the sticky count overflow bit may not be cleared by a WRMSR instruction. When this occurs, that bit can only be cleared by power-on reset.",
        "implication": " Software that uses the Corrected Error Count field and expects to be able to clear the sticky count overflow bit may misinterpret the number of corrected errors when the sticky count overflow bit is set. This erratum does not affect threshold-based CMCI (Corrected Machine Check Error Interrupt) signaling.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL018": {
        "title": "PEBS Eventing IP Field May be Incorrect After Not-Taken Branch",
        "problem": " When a PEBS (Precise-Event-Based-Sampling) record is logged immediately after a not-taken conditional branch (Jcc instruction), the Eventing IP field should contain the address of the first byte of the Jcc instruction. Due to this erratum, it may instead contain the address of the instruction preceding the Jcc instruction.",
        "implication": "Performance monitoring software using PEBS may incorrectly attribute PEBS events that occur on a Jcc to the preceding instruction.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL019": {
        "title": "Debug Exceptions May Be Lost or Misreported Following WRMSR to IA32_BIOS_UPDT_TRIG",
        "problem": " If the WRMSR instruction writes to the IA32_BIOS_UPDT_TRIG MSR (79H) immediately after an execution of MOV SS or POP SS that generated a debug exception, the processor may fail to deliver the debug exception or, if it does, the DR6 register contents may not correctly reflect the causes of the debug exception.",
        "implication": "Debugging software may fail to operate properly if a debug exception is lost or does not report complete information.",
        "workaround": "Software should avoid using WRMSR instruction immediately after executing MOV SS or POP SS",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL020": {
        "title": "Attempts to Retrain a PCIe* Link May be Ignored",
        "problem": " A PCIe link should retrain when Retrain Link (bit 5) in the Link Control register (Bus 0; Device 1; Functions 0, 1, 2; Offset 0xB0) is set. Due to this erratum, if the link is in the L1 state, it may ignore the retrain request.",
        "implication": "The PCIe link may not behave as expected.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL021": {
        "title": "Intel® Processor Trace PSB+ Packets May Contain Unexpected Packets",
        "problem": " Some Intel Processor Trace packets should be issued only between TIP.PGE (Target IP Packet.Packet Generation Enable) and TIP.PGD (Target IP Packet.Packet Generation Disable) packets. Due to this erratum, when a TIP.PGE packet is generated it may be preceded by a PSB+ (Packet Stream Boundary) that incorrectly includes FUP (Flow Update Packet) and MODE.Exec packets.",
        "implication": "Due to this erratum, FUP and MODE.Exec may be generated unexpectedly.",
        "workaround": "Decoders should ignore FUP and MODE.Exec packets that are not between TIP.PGE and TIP.PGD packets.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL022": {
        "title": "An APIC Timer Interrupt During Core C6 Entry May be Lost",
        "problem": "Due to this erratum, an APIC timer interrupt coincident with the core entering C6 state may be lost rather than held for servicing later.",
        "implication": "A lost APIC timer interrupt may lead to missed deadlines or a system hang.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL024": {
        "title": "VM Entry That Clears TraceEn May Generate a FUP",
        "problem": " If VM entry clears Intel® PT (Intel Processor Trace) IA32_RTIT_CTL.TraceEn (MSR 570H, bit 0) while PacketEn is 1 then a FUP (Flow Update Packet) will precede the TIP.PGD (Target IP Packet, Packet Generation Disable). VM entry can clear TraceEn if the VM-entry MSR-load area includes an entry for the IA32_RTIT_CTL MSR.",
        "implication": " When this erratum occurs, an unexpected FUP may be generated that creates the appearance of an asynchronous event taking place immediately before or during the VM entry.",
        "workaround": "The Intel PT trace decoder may opt to ignore any FUP whose IP matches that of a VM entry instruction.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL025": {
        "title": "EDRAM Corrected Error Events May Not be Properly Logged After a Warm Reset",
        "problem": " After a warm reset, an EDRAM corrected error may not be logged correctly until the associated machine check register is initialized. This erratum may affect IA32_MC8_STATUS or IA32_MC10_STATUS.",
        "implication": "The EDRAM corrected error information may be lost when this erratum occurs.",
        "workaround": "Data from the affected machine check registers should be read and the registers initialized as soon as practical after a warm reset.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL026": {
        "title": "Performance Monitor Event For Outstanding Offcore Requests May be Incorrect",
        "problem": " The performance monitor event OFFCORE_REQUESTS_OUTSTANDING (Event 60H, any Umask Value) should count the number of offcore outstanding transactions each cycle. Due to this erratum, the counts may be higher or lower than expected.",
        "implication": "The performance monitor event OFFCORE_REQUESTS_OUTSTANDING may reflect an incorrect count.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL027": {
        "title": "Processor Instability May Occur When Using The PECI RdIAMSR Command",
        "problem": " Under certain circumstances, reading a machine check register using the PECI (Platform Environmental Control Interface) RdIAMSR command may result in a machine check, processor hang or shutdown.",
        "implication": "Machine check, hang or shutdown may be observed when using the PECI RdIAMSR command.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL028": {
        "title": "ENCLU[EGETKEY] Ignores KEYREQUEST.MISCMASK",
        "problem": " The Intel® SGX (Software Guard Extensions) ENCLU[EGETKEY] instruction ignores the MISCMASK field in KEYREQUEST structure when computing a provisioning key, a provisioning seal key, or a seal key.",
        "implication": " ENCLU[EGETKEY] will return the same key in response to two requests that differ only in the value of KEYREQUEST.MISCMASK. Intel has not observed this erratum with any commercially available software.",
        "workaround": " When executing the ENCLU[EGETKEY] instruction, software should ensure the bits set in KEYREQUEST.MISCMASK are a subset of the bits set in the current SECS’s MISCSELECT field.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL029": {
        "title": "POPCNT Instruction May Take Longer to Execute Than Expected",
        "problem": "POPCNT instruction execution with a 32 or 64 bit operand may be delayed until previous non-dependent instructions have executed.",
        "implication": "Software using the POPCNT instruction may experience lower performance than expected.",
        "workaround": "None identified",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL030": {
        "title": "ENCLU[EREPORT] May Cause a #GP When TARGETINFO.MISCSELECT is Non- Zero",
        "problem": " The Intel® SGX (Software Guard extensions) ENCLU[EREPORT] instruction may cause a #GP (general protection fault) if any bit is set in TARGETINFO structure’s MISCSELECT field.",
        "implication": "This erratum may cause unexpected general-protection exceptions inside enclaves.",
        "workaround": " When executing the ENCLU[EREPORT] instruction, software should ensure the bits set in TARGETINFO.MISCSELECT are a subset of the bits set in the current SECS’s MISCSELECT field.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL031": {
        "title": "A VMX Transition Attempting to Load a Non-Existent MSR May Result in a Shutdown",
        "problem": " A VMX transition may result in a shutdown (without generating a machine-check event) if a non-existent MSR is included in the associated MSR-load area. When such a shutdown occurs, a machine check error will be logged with IA32_MCi_STATUS.MCACOD (bits [15:0]) of 406H, but the processor does not issue the special shutdown cycle. A hardware reset must be used to restart the processor.",
        "implication": "Due to this erratum, the hypervisor may experience an unexpected shutdown.",
        "workaround": "Software should not configure VMX transitions to load non-existent MSRs.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL032": {
        "title": "Transitions Out of 64-bit Mode May Lead to an Incorrect FDP And FIP",
        "problem": " A transition from 64-bit mode to compatibility or legacy modes may result in cause a subsequent x87 FPU state save to zeroing bits [63:32] of the FDP (x87 FPU Data Pointer Offset) and the FIP (x87 FPU Instruction Pointer Offset).",
        "implication": "Leaving 64-bit mode may result in incorrect FDP and FIP values when x87 FPU state is saved.",
        "workaround": "None identified. 64-bit software should save x87 FPU state before leaving 64-bit mode if it needs to access the FDP and/or FIP values.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL033": {
        "title": "Intel® PT FUP May be Dropped After OVF",
        "problem": "Some Intel PT (Intel Processor Trace) OVF (Overflow) packets may not be followed by a FUP (Flow Update Packet) or TIP.PGE (Target IP Packet, Packet Generation Enable).",
        "implication": "When this erratum occurs, an unexpected packet sequence is generated.",
        "workaround": "When it encounters an OVF without a following FUP or TIP.PGE, the Intel PT trace decoder should scan for the next TIP, TIP.PGE, or PSB+ to resume operation.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL034": {
        "title": "ENCLS[ECREATE] Causes #GP if Enclave Base Address is Not Canonical",
        "problem": " The ENCLS[ECREATE] instruction uses an SECS (SGX enclave control structure) referenced by the SRCPAGE pointer in the PAGEINFO structure, which is referenced by the RBX register. Due to this erratum, the instruction causes a #GP (general- protection fault) if the SECS attributes indicate that the enclave should operate in 64- bit mode and the enclave base linear address in the SECS is not canonical.",
        "implication": " System software will incur a general-protection fault if it mistakenly programs the SECS with a non-canonical address. Intel has not observed this erratum with any commercially available software.",
        "workaround": "System software should always specify a canonical address as the base address of the 64-bit mode enclave.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL035": {
        "title": "Data Breakpoint May Not be Detected on a REP MOVS",
        "problem": "A REP MOVS instruction that causes an exception or a VM exit may not detect a data breakpoint that occurred on an earlier memory access of that REP MOVS instruction.",
        "implication": "A debugger may miss a data read/write access if it is done by a REP MOVS instruction",
        "workaround": "Software that relies on data breakpoint for correct execution should disable fast- strings (bit 0 in IA32_MISC_ENABLE MSR).",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL036": {
        "title": "Graphics VTd Hardware May Cache Invalid Entries",
        "problem": " The processor’s graphics IOMMU (I/O Memory Management Unit) may cache invalid VTd context entries. This violates the VTd specification for HW Caching Mode where hardware implementations of this architecture must not cache invalid entries.",
        "implication": "Due to this erratum, unpredictable system behavior and/or a system hang may occur.",
        "workaround": "Software should flush the Gfx VTd context cache after any update of context table entries.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL037": {
        "title": "PCIe* and DMI Links With Lane Polarity Inversion May Result in Link Failure",
        "problem": "The processor’s PCIe and DMI links may fail after exiting Package C7 or deeper if the platform requires the link to utilize lane polarity inversion.",
        "implication": "Due to this erratum, the processor cannot support lane polarity inversion on the PCIe or DMI links when Package C7 or deeper is enabled.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL038": {
        "title": "PCIe* Expansion ROM Base Address Register May be Incorrect",
        "problem": " After PCIe 8.0 GT/s Link Equalization on a root port (Bus 0; Device 1; Function 0, 1, 2) has completed, the Expansion ROM Base Address Register (Offset 38H) may be incorrect.",
        "implication": "Software that uses this BAR may behave unexpectedly. Intel has not observed this erratum with any commercially available software.",
        "workaround": " It is possible for the BIOS to contain a partial workaround for this erratum. Software should wait at least 5ms following link equalization before accessing these Expansion ROM Base Address Register.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL039": {
        "title": "PCIe* Perform Equalization May Lead to Link Failure",
        "problem": " Due to this erratum, when a processor PCIe port operating at 8.0 GT/s is directed to redo equalization, either via software or from the link partner, incorrect coefficients may be conveyed during Equalization Phase 3.",
        "implication": "If the link partner accepts the incorrect coefficients, the link may become unstable. Note this affects 8.0 GT/s only.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL040": {
        "title": "Two DIMMs Per Channel 2133 MHz DDR4 SODIMM Daisy-Chain Systems With Different Vendors May Hang",
        "problem": " When, on a single memory channel with 2133 MHz DDR4 SODIMMs, mixing different vendors or mixing single rank and dual rank DIMMs, may lead to a higher rate of correctable errors or system hangs.",
        "implication": "Due to this erratum, reported correctable error counts may increase or system may hang.",
        "workaround": "Use a single vendor for and do not mix single rank and dual rank 2133 MHz DDR4 SODIMM.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL041": {
        "title": "ENCLS[EINIT] Instruction May Unexpectedly #GP",
        "problem": " When using Intel® SGX (Software Guard Extensions), the ENCLS[EINIT] instruction will incorrectly cause a #GP (general protection fault) if the MISCSELECT field of the SIGSTRUCT structure is not zero.",
        "implication": " This erratum may cause an unexpected #GP, but only if software has set bits in the MISCSELECT field in SIGSTRUCT structure that do not correspond to extended features that can be written to the MISC region of the SSA (State Save Area). Intel has not observed this erratum with any commercially available software.",
        "workaround": " When executing the ENCLS[EINIT] instruction, software should only set bits in the MISCSELECT field in the SIGSTRUCT structure that are enumerated as 1 by CPUID.(EAX=12H,ECX=0):EBX (the bit vector of extended features that can be written to the MISC region of the SSA).",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL042": {
        "title": "Intel® PT OVF Packet May be Lost if Immediately Preceding a TraceStop",
        "problem": " If an Intel PT (Intel® Processor Trace) internal buffer overflow occurs immediately before software executes a taken branch or event that enters an Intel PT TraceStop region, the OVF (Overflow) packet may be lost.",
        "implication": "The trace decoder will not see the OVF packet, nor any subsequent packets (e.g., TraceStop) that were lost due to overflow.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL043": {
        "title": "Detecting an Intel® PT Stopped or Error Condition Within an Intel® TSX Region May Result in a System Hang",
        "problem": " While executing within an Intel TSX (Intel® Transactional Synchronization Extensions) transactional region with Intel PT (Intel® Processor Trace) enabled and an event occurs that causes either the Error bit (bit 4) or Stopped bit (bit 5) in the IA32_RTIT_STATUS MSR (0571H) to be set then, due to this erratum, the system may hang.",
        "implication": "A system hang may occur when Intel PT and Intel TSX are used together.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL044": {
        "title": "WRMSR to IA32_BIOS_UPDT_TRIG May be Counted as Multiple Instructions",
        "problem": " When software loads a microcode update by writing to MSR IA32_BIOS_UPDT_TRIG (79H) on multiple logical processors in parallel, a logical processor may, due to this erratum, count the WRMSR instruction as multiple instruction-retired events.",
        "implication": " Performance monitoring with the instruction-retired event may over count by up to four extra events per instance of WRMSR which targets the IA32_BIOS_UPDT_TRIG register.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL045": {
        "title": "The x87 FIP May be Incorrect",
        "problem": " The x87 FPU should update the x87 FIP (FPU instruction pointer) for every non- control x87 instruction executed. Due to this erratum, the FIP is valid only if the last non-control FP instruction had an unmasked exception.",
        "implication": " When this erratum occurs, an instruction that saves FIP (e.g., FSTENV) may save an incorrect value. Software that depends on the FIP value for x87 non-control instructions without unmasked exceptions may not operate as expected.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL046": {
        "title": "Branch Instructions May Initialize MPX Bound Registers Incorrectly",
        "problem": " Depending on the current Intel® MPX (Memory Protection Extensions) configuration, execution of certain branch instructions (near CALL, near RET, near JMP, and Jcc instructions) without a BND prefix (F2H) initialize the MPX bound registers. Due to this erratum, execution of such a branch instruction on a user-mode page may not use the MPX configuration register appropriate to the current privilege level (BNDCFGU for CPL 3 or BNDCFGS otherwise) for determining whether to initialize the bound registers; it may thus initialize the bound registers when it should not, or fail to initialize them when it should.",
        "implication": " After a branch instruction on a user-mode page has executed, a #BR (bound-range) exception may occur when it should not have or a #BR may not occur when one should have.",
        "workaround": " If supervisor software is not expected to execute instructions on user-mode pages, software can avoid this erratum by setting CR4.SMEP [bit 20] to enable supervisor- mode execution prevention (SMEP). If SMEP is not available or if supervisor software is expected to execute instructions on user-mode pages, no workaround is identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL047": {
        "title": "Writing a Non-Canonical Value to an LBR MSR Does Not Signal a #GP When Intel® PT is Enabled",
        "problem": " If Intel PT (Intel Processor Trace) is enabled, WRMSR will not cause a general- protection exception (#GP) on an attempt to write a non-canonical value to any of the following MSRs: MSR_LASTBRANCH_{0 - 31}_FROM_IP (680H – 69FH) MSR_LASTBRANCH__{0 - 31}_TO_IP (6C0H – 6DFH) MSR_LASTBRANCH_FROM_IP (1DBH) MSR_LASTBRANCH_TO_IP (1DCH) MSR_LASTINT_FROM_IP (1DDH) MSR_LASTINT_TO_IP (1DEH) Instead the same behavior will occur as if a canonical value had been written. Specifically, the WRMSR will be dropped and the MSR value will not be changed.",
        "implication": "Due to this erratum, an expected #GP may not be signaled.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL048": {
        "title": "Processor May Run Intel® AVX Code Much Slower Than Expected",
        "problem": "After a C6 state exit, the execution rate of AVX instructions may be reduced.",
        "implication": "Applications using AVX instructions may run slower than expected.",
        "workaround": "It is possible for the BIOS to contain a workaround",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL049": {
        "title": "Intel® PT Buffer Overflow May Result in Incorrect Packets",
        "problem": " Under complex micro-architectural conditions, an Intel PT (Processor Trace) OVF (Overflow) packet may be issued after the first byte of a multi-byte CYC (Cycle Count) packet, instead of any remaining bytes of the CYC.",
        "implication": " When this erratum occurs, the splicing of the CYC and OVF packets may prevent the Intel PT decoder from recognizing the overflow. The Intel PT decoder may then encounter subsequent packets that are not consistent with expected behavior.",
        "workaround": " None Identified. The decoder may be able to recognize that this erratum has occurred when a two-byte CYC packet is followed by a single-byte CYC, where the latter 2 bytes are 0xf302, and where the CYC packets are followed by a FUP (Flow Update Packet) and a PSB+ (Packet Stream Boundary+). It should then treat the two CYC packets as indicating an overflow.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL050": {
        "title": "Intel® PT PSB+ Packets May be Omitted on a C6 Transition",
        "problem": " An Intel PT (Processor Trace) PSB+ (Packet Stream Boundary+) set of packets may not be generated as expected when IA32_RTIT_STATUS.PacketByteCnt[48:32] (MSR 0x571) reaches the PSB threshold and a logical processor C6 entry occurs within the following one KByte of trace output.",
        "implication": "After a logical processor enters C6, Intel PT output may be missing PSB+ sets of packets.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL051": {
        "title": "IA32_PERF_GLOBAL_STATUS.TRACE_TOPA_PMI Bit Cannot be Set by Software",
        "problem": " A WRMSR that attempts to set Trace_ToPA_PMI (bit 55) in the IA32_PERF_GLOBAL_STATUS MSR (38EH) by writing a ‘1’ to bit 55 in the IA32_PERF_GLOBAL_STATUS_SET (MSR (391H) will cause a #GP fault.",
        "implication": "Software cannot set the Trace_ToPA_PMI bit.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL052": {
        "title": "CPUID Incorrectly Reports Bit Manipulation Instructions Support",
        "problem": "Executing CPUID with EAX = 7 and ECX = 0 may return EBX with bits [3] and [8] set, incorrectly indicating the presence of BMI1 and BMI2 instruction set extensions.",
        "implication": "Attempting to use instructions from the BMI1 or BMI2 instruction set extensions will result in a #UD exception.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL053": {
        "title": "Intel® Turbo Boost Technology May be Incorrectly Reported as Supported",
        "problem": "These processors may incorrectly report support for Intel® Turbo Boost Technology via CPUID.06H.EAX bit 1.",
        "implication": "The CPUID instruction may report Turbo Boost Technology as supported even though the processor does not permit operation above the Base Frequency.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL055": {
        "title": "Use of Prefetch Instructions May Lead to a Violation of Memory Ordering",
        "problem": " Under certain micro architectural conditions, execution of a PREFETCHh instruction or a PREFETCHW instruction may cause a load from the prefetched cache line to appear to execute before an earlier load from another cache line.",
        "implication": "Software that relies on loads executing in program order may not operate correctly.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL056": {
        "title": "CS Limit Violation May Not be Detected",
        "problem": "A CS (code segment) limit reduction may not be properly applied.",
        "implication": "Instructions may be executed beyond the CS limit. Intel has not observed this erratum to impact the operation of any commercially available software.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL057": {
        "title": "Last Level Cache Performance Monitoring Events May be Inaccurate",
        "problem": " The performance monitoring events LONGEST_LAT_CACHE.REFERENCE (Event 2EH; Umask 4FH) and LONGEST_LAT_CACHE.MISS (Event 2EH; Umask 41H) count requests that reference or miss in the last level cache. However, due to this erratum, the count may be incorrect.",
        "implication": "LONGEST_LAT_CACHE events may be incorrect.",
        "workaround": " None identified. Software may use the following OFFCORE_REQUESTS model-specific sub events that provide related performance monitoring data: DEMAND_DATA_RD, DEMAND_CODE_RD, DEMAND_RFO, ALL_DATA_RD, L3_MISS_DEMAND_DATA_RD, ALL_REQUESTS.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL058": {
        "title": "#GP Occurs Rather Than #DB on Code Page Split Inside an Intel® SGX Enclave",
        "problem": " When executing within an Intel® SGX (Software Guard Extensions) enclave, a #GP (general-protection exception) may be delivered instead of a #DB (debug exception) when an instruction breakpoint is detected. This occurs when the instruction to be executed spans two pages, the second of which has an entry in the EPCM (enclave page cache map) that is not valid.",
        "implication": "Debugging software may not be invoked when an instruction breakpoint is detected.",
        "workaround": "Software should ensure that all pages containing enclave instructions have valid EPCM entries.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL059": {
        "title": "Execution of VAESENCLAST Instruction May Produce a #NM Exception Instead of a #UD Exception",
        "problem": " Execution of VAESENCLAST with VEX.L= 1 should signal a #UD (Invalid Opcode) exception, however, due to the erratum, a #NM (Device Not Available) exception may be signaled.",
        "implication": "As a result of this erratum, an operating system may restore AVX and other state unnecessarily.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL060": {
        "title": "Intel® SGX Enclave Accesses to the APIC-Access Page May Cause APIC- Access VM Exits",
        "problem": "In VMX non-root operation, Intel SGX (Software Guard Extensions) enclaves accesses to the APIC-access page may cause APIC-access VM exits instead of page faults.",
        "implication": " A VMM (virtual-machine monitor) may receive a VM exit due to an access that should have caused a page fault, which would be handled by the guest OS (operating system).",
        "workaround": " A VMM avoids this erratum if it does not map any part of the EPC (Enclave Page Cache) to the guest’s APIC-access address; an operating system avoids this erratum if it does not attempt indirect enclave accesses to the APIC.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL061": {
        "title": "CR3 Filtering Does Not Compare Bits [11:5] of CR3 and IA32_RTIT_CR3_MATCH in PAE Paging Mode",
        "problem": " In PAE paging mode, the CR3[11:5] are used to locate the page-directory-pointer table. Due to this erratum, those bits of CR3 are not compared to IA32_RTIT_CR3_MATCH (MSR 572H) when IA32_RTIT_CTL.CR3Filter (MSR 570H, bit 7) is set.",
        "implication": " If multiple page-directory-pointer tables are co-located within a 4KB region, CR3 filtering will not be able to distinguish between them so additional processes may be traced.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL062": {
        "title": "Intel® PT PacketEn Change on C-state Wake May Not Generate a TIP Packet",
        "problem": " A TIP.PGE (Target IP, Packet Generation Enabled) or TIP.PGD (Target IP, Packet Generation Disabled) packet may not be generated if Intel PT (Processor Trace) PacketEn changes after IA32_RTIT_STATUS.FilterEn (MSR 571H, bit 0) is re- evaluated on wakeup from C6 or deeper sleep state.",
        "implication": " When code enters or exits an IP filter region without a taken branch, tracing may begin or cease without proper indication in the trace output. This may affect trace decoder behavior.",
        "workaround": "None identified. A trace decoder will need to skip ahead to the next TIP or FUP packet to determine the current IP.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL063": {
        "title": "Graphics Configuration May Not be Correctly Restored After a Package C8 Exit",
        "problem": "The processor should ensure internal graphics configuration is restored during a Package C8 or deeper exit event. Due to this erratum, some internal graphics configurations may not be correctly restored.",
        "implication": "When this erratum occurs, a graphics driver restart may lead to system instability. Such a restart may occur when upgrading the graphics driver.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL064": {
        "title": "x87 FDP Value May be Saved Incorrectly",
        "problem": " Execution of the FSAVE, FNSAVE, FSTENV, or FNSTENV instructions in real-address mode or virtual-8086 mode may save an incorrect value for the x87 FDP (FPU data pointer). This erratum does not apply if the last non-control x87 instruction had an unmasked exception.",
        "implication": " Software operating in real-address mode or virtual-8086 mode that depends on the FDP value for non-control x87 instructions without unmasked exceptions may not operate properly.",
        "workaround": " None identified. Software should use the FDP value saved by the listed instructions only when the most recent non-control x87 instruction incurred an unmasked exception.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL065": {
        "title": "PECI Frequency Limited to 1 MHz",
        "problem": " The PECI (Platform Environmental Control Interface) 3.1 specification’s operating frequency range is 0.2 MHz to 2 MHz. Due to this erratum, PECI may be unreliable when operated above 1 MHz.",
        "implication": "Platforms attempting to run PECI above 1 MHz may not behave as expected.",
        "workaround": "None identified. Platforms should limit PECI operating frequency to 1 MHz.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL066": {
        "title": "Processor Graphics IOMMU Unit May Not Mask DMA Remapping Faults",
        "problem": " Intel® Virtualization Technology for Directed I/O specification specifies setting the FPD (Fault Processing Disable) field in the context (or extended-context) entry of IOMMU to mask recording of qualified DMA remapping faults for DMA requests processed through that context entry. Due to this erratum, the IOMMU unit for Processor Graphics device may record DMA remapping faults from Processor Graphics device (Bus: 0; Device: 2; Function: 0) even when the FPD field is set to 1.",
        "implication": "Software may continue to observe DMA remapping faults recorded in the IOMMU Fault Recording Register even after setting the FPD field.",
        "workaround": " None identified. Software may mask the fault reporting event by setting the IM (Interrupt Mask) field in the IOMMU Fault Event Control register (Offset 038H in GFXVTBAR).",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL067": {
        "title": "Processor With Intel® SGX Support May Hang During S3 Wake or Power-On Reset",
        "problem": " Processors that support Intel® SGX (Intel Software Guard Extensions) may experience hangs when waking from S3 (Standby) system sleep state or during a power-on reset. This erratum may occur even if the Intel SGX feature is not enabled.",
        "implication": "Due to this erratum, the system may not wake after entering standby sleep state or may not start up after a power-on reset",
        "workaround": " It is possible for the BIOS to contain a workaround for this erratum. For systems that do not power gate Vcc Sustain, if the workaround detects this erratum, support for Intel SGX will be removed until platform power is disconnected and reapplied.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL068": {
        "title": "Audio Glitches May Occur After Reset or S3/S4 Exit",
        "problem": "After a reset or S3/S4 exit the processor may operate at a lower than expected frequency.",
        "implication": "When this erratum occurs, the processor may be unable to adequately support audio playback resulting in several seconds of audio glitches.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL069": {
        "title": "Intel® PT CYCThresh Value of 13 is Not Supported",
        "problem": " Intel PT (Intel® Processor Trace) CYC (Cycle Count) threshold is configured through CYCThresh field in bits [22:19] of IA32_RTIT_CTL MSR (570H). A value of 13 is advertised as supported by CPUID (leaf 14H, sub-lead 1H). Due to this erratum, if CYCThresh is set to 13 then the CYC threshold will be 0 cycles instead of 4096 (213- 1) cycles.",
        "implication": "CYC packets may be issued in higher rate than expected if threshold value of 13 is used.",
        "workaround": "None identified. Software should not use value of 13 for CYC threshold.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL070": {
        "title": "Exx. Intel® PT May Drop Some Timing Packets After Entering Thread",
        "problem": " Intel PT (Intel® Processor Trace) may temporarily stop sending MTC (Mini Time Counter) and CYC (Cycle) packets after entering thread C3 state. MTC and CYC packets may be missing in up to 1KB of trace output after entering thread C3.",
        "implication": "Some Intel PT timing packets may temporarily not be sent after thread C3 is entered.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL071": {
        "title": "Underflow and Denormal Conditions During a VDPPS Instruction With YMM Operands May Not Produce The Expected Results",
        "problem": " A VDPPS (Vector Dot Product of Packed Single Precision Floating-Point Values) instruction operating on YMM registers with denormal operand(s) or experiencing an underflow may not produce the expected result if the exception is masked in the MXCSR. This may also happen when intermediate multiply results have underflow conditions.",
        "implication": "VDPPS with YMM registers may not produce the expected result.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL072": {
        "title": "IA Core Ratio Change Coincident With Outstanding Read to the DE May Cause a System Hang",
        "problem": "An outstanding read from an IA core to the DE (Display Engine) that is coincident with an IA core ratio change may result in a system hang.",
        "implication": "Due to this erratum, the system may hang.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL073": {
        "title": "Enabling VMX-Preemption Timer Blocks HDC Operation",
        "problem": " HDC (Hardware Duty Cycling) will not put the physical package into the forced idle state while any logical processor is in VMX non-root operation and the “activate VMX- preemption timer” VM-execution control is 1.",
        "implication": "HDC will not provide the desired power reduction when the VMX-preemption timer is active in VMX non-root operation.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL074": {
        "title": "Certain Processors May be Configured With an Incorrect TDP",
        "problem": " Certain processors should be configured with a TDP (Thermal Design Power) limit of 54 or 51 watts. Due to this erratum, these processors may be incorrectly configured at 65 W TDP. The following processors are affected by this erratum: Intel® Core™ i3 Processor Series, Celeron® and Pentium® (Dual-Core With GT1/GT2). A processor that reports a value of 0x208 in TDP_POWER_OF_SKU field in MSR PACKAGE_POWER_SKU (MSR 614H [14:0]) are affected by this erratum.",
        "implication": "Processors affected by this erratum may spend more time in turbo and thus may experience unexpected thermal throttling events.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL075": {
        "title": "Display Flicker May Occur When Both VT-d And FBC Are Enabled",
        "problem": " Display flickering may occur when both FBC (Frame Buffer Compression) and VT-d (Intel® Virtualization Technology for Directed I/O) are enabled and in use by the display controller.",
        "implication": "Due to this erratum, display flickering may be observed.",
        "workaround": "It is possible for Intel® Graphics Driver 15.40.11.4312 or later to contain a workaround for this erratum. This workaround will disable FBC.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL076": {
        "title": "System May Hang When Using Intel® TXT And Memory That Supports Address Mirroring",
        "problem": " Within platforms that utilize memory that supports address mirroring, processors that utilize Intel TXT (Intel Trusted Execution Technology) measured launch environment may fail to boot and hang.",
        "implication": "Due to this erratum, system may hang.",
        "workaround": "A BIOS workaround has been identified. Please refer to TXT BIOS ACM 1.3 or later and release notes.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL077": {
        "title": "System May Hang or Reset During Processor Package C9 Exit",
        "problem": " Under a complex set of conditions, during a processor Package C9 exit, display artifacts may be seen, the processor may hang, or the processor may incur a machine check exception with an Internal Unclassified error reported in IA32_MCi_STATUS with MCACOD (bits[15:0]) equal to 0x402 and MSCOD (31:16)] equal to 0x94yy (where y can be any value).",
        "implication": "Display artifacts may be seen or the system may log a machine check error and reset or hang when resuming from C9.",
        "workaround": "It is possible for the BIOS and Intel® Graphics Driver 15.40.11.4312 or later to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL078": {
        "title": "Integrated Audio Codec May Not be Detected",
        "problem": " Integrated Audio Codec may lose power when LPSP (Low-Power Single Pipe) mode is enabled for an eDP* (embedded DisplayPort) or HDMI ports. Platforms with Intel® SST (Intel® Smart Sound Technology) enabled are not affected.",
        "implication": " The Audio Bus driver may attempt to do enumeration of Codecs when eDP or HDMI port enters LPSP mode, due to this erratum, the Integrated Audio Codec will not be detected and audio maybe be lost.",
        "workaround": "Intel® Graphics Driver 15.40.11.4312 or later will prevent the Integrated Audio Codec from losing power when LPSP mode is enabled.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL079": {
        "title": "MOVNTDQA From WC Memory May Pass Earlier MFENCE Instructions",
        "problem": "An execution of MOVNTDQA or VMOVNTDQA that loads from WC (write combining) memory may appear to pass an earlier execution of the MFENCE instruction.",
        "implication": " When this erratum occurs, an execution of MOVNTDQA or VMOVNTDQA may appear to execute before memory operations that precede the earlier MFENCE instruction. Software that uses MFENCE to order subsequent executions of the MOVNTDQA instructions may not operate properly.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL080": {
        "title": "APIC Timer Interrupt or Timed MWAIT Wake May Occur Early",
        "problem": " When the APIC timer is configured to TSC Deadline Mode, a timer interrupt may occur before the expected deadline if any of IA32_TSC_DEADLINE MSR (6E0H) bits [63:56] are set. Additionally, a Timed MWAIT with EDX bits [31:24] set may wake early and may set EAX[1] to report that the MWAIT timer caused the wake event.",
        "implication": "A timer interrupt may be delivered earlier than specified by the IA32_TSC_DEADLINE MSR or a Timed MWAIT may wake earlier than its specified deadline.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL081": {
        "title": "Processors That Support EDRAM May Not Initialize Properly",
        "problem": "During platform initialization, the processor’s eDRAM interface may fail to complete its training and configuration sequence.",
        "implication": "When this erratum occurs, a processor that supports eDRAM may not initialize properly.",
        "workaround": "It is possible for BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL082": {
        "title": "Processor May Hang or Cause Unpredictable System Behavior",
        "problem": " Under complex microarchitecture conditions, processor may hang with an internal timeout error (MCACOD 0400H) logged into IA32_MCi_STATUS or cause unpredictable system behavior",
        "implication": "When this issue occurs, the system may cause unpredictable system behavior",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL083": {
        "title": "The Processor May Fail to Properly Exit Package C6 or Deeper",
        "problem": " When the processor exits Package C6 or deeper, it may hang, generate a machine check exception with an Internal Unclassified error reported in IA32_MCi_STATUS with MCACOD (bits[15:0]) equal to 0x402 and MSCOD (31:16)] equal to 0x94yy (where y can be any value), or exhibit unpredictable system behavior.",
        "implication": "Due to this erratum, unpredictable system behavior may occur.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL084": {
        "title": "Certain Processors May Report Incorrect DID2",
        "problem": " The U-processor with GT3 and TDP of 28W may report an incorrect value of 1926H in DID2 (Processor Graphics Device ID) (Bus 0, Device 2, Function 0; offset 2h; bits [15:0]) register. This value should be 1927H.",
        "implication": "Software that decodes DID2 values may not function as expected.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL085": {
        "title": "System May Hang When Entering S3/S4/S5 State",
        "problem": " When entering S3/S4/S5 state, it may hang and generate a machine check with an Internal Unclassified error reported in IA32_MCi_STATUS with MCACOD (bits[15:0]) equal to 0x402 and MSCOD (31:16)] equal to 0x77yy (where y can be any value).",
        "implication": "Due to this erratum a system hang may occur.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL086": {
        "title": "Display Flickering May be Observed with Specific eDP Panels",
        "problem": "The processor may incorrectly configure transmitter buffer characteristics if the associated eDP panel requests VESA equalization preset 3, 5, 6, or 8.",
        "implication": "Display flickering or display loss maybe observed.",
        "workaround": "Intel® Graphics Driver version 15.40.12.4326 or later contains a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL087": {
        "title": "x87 FPU Data Pointer Updated Only For Instructions That Incur Unmasked Exceptions",
        "problem": " The x87 FPU data pointer points to the data (operand) for the last x87 non-control instruction executed, unless CPUID.(EAX=07H,ECX=0H):EBX.FDP_EXCPTN_ONLY[bit 6] is 1, in which case it points to the operand for the last x87 non-control instruction that incurred an unmasked x87 exception. Due to this erratum, x87 FPU data pointer behaves as if the FDP_EXCPTN_ONLY flag is 1 even when that bit is 0.",
        "implication": " If the most recent x87 non-control instruction did not incur an unmasked x87 exception, software that then examines the x87 FPU data pointer will see an incorrect value. Intel has not observed this erratum with any commercially available software.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL088": {
        "title": "Incorrect Branch Predicted Bit in BTS/BTM Branch Records",
        "problem": " BTS (Branch Trace Store) and BTM (Branch Trace Message) send branch records to the Debug Store management area and system bus respectively. The Branch Predicted bit (bit 4 of eighth byte in BTS/BTM records) should report whether the most recent branch was predicted correctly. Due to this erratum, the Branch Predicted bit may be incorrect.",
        "implication": "BTS and BTM cannot be used to determine the accuracy of branch prediction.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL089": {
        "title": "MACHINE_CLEARS.MEMORY_ORDERING Performance Monitoring Event May Undercount",
        "problem": " The performance monitoring event MACHINE_CLEARS.MEMORY_ORDERING (Event C3H; Umask 02H) counts the number of machines clears caused by memory ordering conflicts. However due to this erratum, this event may undercount for VGATHER*/VPGATHER* instructions of four or more elements.",
        "implication": "MACHINE_CLEARS.MEMORY_ORDERING performance monitoring event may undercount.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL090": {
        "title": "CTR_FRZ May Not Freeze Some Counters",
        "problem": " IA32_PERF_GLOBAL_STATUS.CTR_FRZ (MSR 38EH, bit 59) is set when either (1) IA32_DEBUGCTL.FREEZE_PERFMON_ON_PMI (MSR 1D9H, bit 12) is set and a PMI is triggered, or (2) software sets bit 59 of IA32_PERF_GLOBAL_STATUS_SET (MSR 391H). When set, CTR_FRZ should stop all core performance monitoring counters from counting. However, due to this erratum, IA32_PMC4-7 (MSR C5-C8H) may not stop counting. IA32_PMC4-7 are only available when a processor core is not shared by two logical processors.",
        "implication": "General performance monitoring counters 4-7 may not freeze when IA32_PERF_GLOBAL_STATUS.CTR_FRZ is set.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL091": {
        "title": "Instructions And Branches Retired Performance Monitoring Events May Overcount",
        "problem": " The performance monitoring events INST_RETIRED (Event C0H; any Umask value) and BR_INST_RETIRED (Event C4H; any Umask value) count instructions retired and branches retired, respectively. However, due to this erratum, these events may overcount in certain conditions when: - Executing VMASKMOV* instructions with at least one masked vector element - Executing REP MOVS or REP STOS with Fast Strings enabled (IA32_MISC_ENABLES MSR (1A0H), bit 0 set) - An MPX #BR exception occurred on BNDLDX/BNDSTX instructions and the BR_INST_RETIRED (Event C4H; Umask is 00H or 04H) is used.",
        "implication": "INST_RETIRED and BR_INST_RETIRED performance monitoring events may overcount.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL093": {
        "title": "REP MOVS May Not Operate Correctly With EPT Enabled",
        "problem": " Execution of REP MOVS may incorrectly change [R/E]CX, [R/E]SI, and/or [R/E]DI register values during instruction execution. This erratum occurs only if the execution would set an accessed or dirty flag in a paging structure to which EPT does not allow writes.",
        "implication": " Incorrect changes to RCX, RSI, and/or RDI may lead to a block-copy operation with an unexpected length, an unexpected source location, and/or an unexpected destination location.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL094": {
        "title": "Ring Frequency Changes May Cause a Machine Check And System Hang",
        "problem": " Ring frequency changes may lead to a system hang with the processor logging a machine check in IA32_MCi_STATUS where the MCACOD (bits[15:0]) value is 0x0402 and the MSCOD (bits[31:16]) value is 0x77yy (yy is any 8-bit value).",
        "implication": " When this erratum occurs, the system will log a machine check and hang. Power management activity, including system power state changes, can result in ring frequency changes that may trigger this erratum.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL095": {
        "title": "Some OFFCORE_RESPONSE Performance Monitoring Events May Overcount",
        "problem": " The performance monitoring events OFFCORE_RESPONSE (Events B7H and BBH) should count off-core responses matching the request-response configuration specified in MSR_OFFCORE_RSP_0 and MSR_OFFCORE_RSP_1 (1A6H and 1A7H, respectively) for core-originated requests. However, due to this erratum, DMND_RFO (bit 1), DMND_IFETCH (bit 2) and OTHER (bit 15) request types may overcount.",
        "implication": "Some OFFCORE_RESPONSE events may overcount.",
        "workaround": " None identified. Software may use the following model-specific events that provide related performance monitoring data: OFFCORE_REQUESTS (all sub-events), L2_TRANS.L2_WB and L2_RQSTS.PF_MISS.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL096": {
        "title": "Using BIOS to Disable Cores May Lead to a System Hang",
        "problem": "Using the BIOS hardware core disable facility may cause the processor to hang when it attempts to enter or exit Package C6.",
        "implication": "When this erratum occurs, attempting to enter or exit Package C6 state will hang the system.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL099": {
        "title": "Access to SGX EPC Page in BLOCKED State is Not Reported as an SGX- Induced Page Fault",
        "problem": " If a page fault results from attempting to access a page in the SGX (Intel® Software Guard Extensions) EPC (Enclave Page Cache) that is in the BLOCKED state, the processor does not set bit 15 of the error code and thus fails to indicate that the page fault was SGX-induced.",
        "implication": "Due to this erratum, software may not recognize these page faults as being SGX- induced.",
        "workaround": "Before using the EBLOCK instruction to marking a page as BLOCKED, software should use paging to mark the page not present.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL100": {
        "title": "MTF VM Exit on XBEGIN Instruction May Save State Incorrectly",
        "problem": " Execution of an XBEGIN instruction while the monitor trap flag VM-execution control is 1 will be immediately followed by an MTF VM exit. If advanced debugging of RTM transactional regions has been enabled, the VM exit will erroneously save as instruction pointer the address of the XBEGIN instruction instead of the fallback instruction address specified by the XBEGIN instruction. In addition, it will erroneously set bit 16 of the pending-debug-exceptions field in the VMCS indicating that a debug exception or a breakpoint exception occurred.",
        "implication": " Software using the monitor trap flag to debug or trace transactional regions may not operate properly. Intel has not observed this erratum with any commercially available software.",
        "workaround": "None identified",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL101": {
        "title": "PCIe* Atomic Operations May Lead to Unpredictable System Behavior",
        "problem": " Processors with eDRAM do not support PCIe Atomic Operations. Due to this erratum, processors with eDRAM incorrectly advertise support for PCIe Atomic Operations in DCAP2 CSRs (Bus 0; Device 1; Function 0,1,2; Offset 0xC4), bits[9:7].",
        "implication": "Use of PCIe Atomic Operations may lead to unpredictable system behavior.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL102": {
        "title": "Instructions That Cause #NM May Lead to Hang",
        "problem": " An x87 FPU instruction or AESNI instruction executed while CR0.TS[bit 3]=1 should cause an #NM (device not available) exception. Due to this erratum, executing such instructions when Intel Hyper-Threading Technology is enabled may result in a hang with an internal timeout error (MCACOD 0400H) logged into IA32_MCi_STATUS bits [15:0].",
        "implication": "When this erratum occurs, the system will experience a fatal machine check. Intel has not observed this erratum with any commercially available software.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL103": {
        "title": "Enabling S3 on Processors With EDRAM May Cause Unpredictable System Behavior",
        "problem": "Entering S3 when EDRAM is enabled may lead to unpredictable system behavior.",
        "implication": "When this erratum occurs, the system may exhibit unpredictable system behavior.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL104": {
        "title": "PEBS Record May Be Generated After Being Disabled",
        "problem": " A performance monitoring counter may generate a PEBS (Precise Event Based Sampling) record after disabling PEBS or the performance monitoring counter by clearing the corresponding enable bit in IA32_PEBS_ENABLE MSR (3F1H) or IA32_PERF_GLOBAL_CTRL MSR (38FH).",
        "implication": " A PEBS record generated after a VMX transition will store into memory according to the post-transition DS (Debug Store) configuration. These stores may be unexpected if PEBS is not enabled following the transition.",
        "workaround": " It is possible for the BIOS to contain a workaround for this erratum. A software workaround is possible through disallowing PEBS during VMX non-root operation and disabling PEBS prior to VM entry.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL105": {
        "title": "Software Using Intel® TSX May Result in Unpredictable System Behavior",
        "problem": " Under a complex set of internal timing conditions and system events, software using the Intel TSX (Transactional Synchronization Extensions) instructions may result in unpredictable system behavior.",
        "implication": "This erratum may result in unpredictable system behavior.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL106": {
        "title": "Package-C6 Exit Latency May be Higher Than Expected Leading to Display Flicker",
        "problem": "Package-C6 exit latency may be higher than expected.",
        "implication": "Due to this erratum, the display may flicker or other Isochronous devices may be affected.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL107": {
        "title": "EDRAM May Cause Unpredictable System Behavior",
        "problem": "EDRAM, under certain low-power conditions, may lead to unpredictable behavior.",
        "implication": "When this erratum occurs, the system will behave unpredictably",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL108": {
        "title": "PCIe* Port Does Not Support DLL Link Activity Reporting",
        "problem": " The PCIe Base specification requires DLL (Data Link Layer) Link Activity Reporting when 8 GT/s link speed is supported. Due to this erratum, link activity reporting is not supported",
        "implication": "Due to this erratum, PCIe port does not support DLL Link Activity Reporting when 8 GT/s is supported.",
        "workaround": "None identified",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL109": {
        "title": "Enabling Package C8 State or Deeper May Lead to Display Flicker or a System Hang",
        "problem": "Under certain conditions, when Package C8 state or deeper is enabled, display flickering may be observed and/or the system may hang.",
        "implication": "When this erratum occurs, the display may flicker and/or the system may hang.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL110": {
        "title": "System May Hang When EDRAM is Enabled And DDR is Operating at 1600 MHz",
        "problem": "When EDRAM is enabled and the DDR operating frequency is 1600 MHz, a system hang may occur",
        "implication": "When this erratum occurs, the system may hang.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL111": {
        "title": "DR6.B0-B3 May Not Report All Breakpoints Matched When a MOV/POP SS is Followed by a Store or an MMX Instruction",
        "problem": " Normally, data breakpoints match that occur on a MOV SS, r/m or POP SS will not cause a debug exception immediately after MOV/POP SS but will be delayed until the instruction boundary following the next instruction is reached. After the debug exception occurs, DR6.B0-B3 bits will contain information about data breakpoints matched during the MOV/POP SS as well as breakpoints detected by the following instruction. Due to this erratum, DR6.B0-B3 bits may not contain information about data breakpoints matched during the MOV/POP SS when the following instruction is either an MMX instruction that uses a memory addressing mode with an index or a store instruction.",
        "implication": " When this erratum occurs, DR6 may not contain information about all breakpoints matched. This erratum will not be observed under the recommended usage of the MOV SS, r/m or POP SS instructions (i.e., following them only with an instruction that writes (E/R)SP).",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL112": {
        "title": "Package C3 Exit Latency May be Longer Than Expected Leading to Display Flicker",
        "problem": "Package C3 exit latency may be longer than expected.",
        "implication": "When this erratum occurs on a system with multiple high-resolution displays, the displays may flicker",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL113": {
        "title": "Processor DDR VREF Signals May Briefly Exceed JEDEC Specifications When Entering S3 State",
        "problem": "Voltage glitch of up to 200mV on the VREF signal lasting for about 1mS may be observed when entering System S3 state. This violates the JEDEC DDR specifications.",
        "implication": "Intel has not observed this erratum to impact the operation of any commercially available system.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL114": {
        "title": "Complex Interactions With Internal Graphics May Impact Processor Responsiveness",
        "problem": " Under complex conditions associated with the use of internal graphics, the processor may exceed the MAX_LAT CSR values (PCI configuration space, offset 03FH, bits[7:0]).",
        "implication": "When this erratum occurs, the processor responsiveness is affected. Intel has not observed this erratum with any commercially available software.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL115": {
        "title": "#GP on Segment Selector Descriptor that Straddles Canonical Boundary May Not Provide Correct Exception Error Code",
        "problem": " During a #GP (General Protection Exception), the processor pushes an error code on to the exception handler’s stack. If the segment selector descriptor straddles the canonical boundary, the error code pushed onto the stack may be incorrect.",
        "implication": "An incorrect error code may be pushed onto the stack. Intel has not observed this erratum with any commercially available software.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL116": {
        "title": "After a Package C10 Sleep State Exit, a Subsequent C8/C9 Exit May Cause System Hang",
        "problem": "If Package C10 sleep state has been entered and exited, a later Package C8/C9 sleep state entrance/exit may cause the system to hang.",
        "implication": "When this erratum occurs, the system hangs.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL117": {
        "title": "Performance Monitoring Counters May Undercount When Using CPL Filtering",
        "problem": " Performance Monitoring counters configured to count only OS or only USR events by setting exactly one of bits 16 or 17 in IA32_PERFEVTSELx MSRs (186H-18DH) may not count for a brief period during the transition to a new CPL.",
        "implication": " A measurement of ring transitions (using the edge-detect bit 18 in IA32_PERFEVTSELx) may undercount, such as CPL_CYCLES.RING0_TRANS (Event 5CH, Umask 01H). Additionally, the sum of an OS-only event and a USR-only event may not exactly equal an event counting both OS and USR. Intel has not observed any other software-visible impact.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL118": {
        "title": "Memory Controller CKE Signal May Not be Expected Value When Executing Boundary Scan EXTEST Command",
        "problem": "If RESET# is asserted while EXTEST command is run, the CKE signal will always be observed as a low value instead of toggling as the BCSAN pattern is shifted.",
        "implication": "Due to this erratum, the CKE signal may be observed low during the EXTEST Command.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL119": {
        "title": "Certain Non-Canonical IA32_BNDCFGS Values Will Not Cause VM-Entry Failures",
        "problem": " If the VM-entry controls Load IA32_BNDCFGS field (bit 16) is 1, VM-entry should fail when the value of the guest IA32_BNDCFGS field in the VMCS is not canonical (that is, when bits 63:47 are not identical). Due to this erratum, VM-entry does not fail if bits 63:48 are identical but differ from bit 47. In this case, VM-entry loads the IA32_BNDCFGS MSR with a value in which bits 63:48 are identical to the value of bit 47 in the VMCS field.",
        "implication": "If the value of the guest IA32_BNDCFGS field in the VMCS is not canonical, VM-entry may load the IA32_BNDCFGS MSR with a value different from that of the VMCS field.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL120": {
        "title": "PEBS EventingIP Field May Be Incorrect Under Certain Conditions",
        "problem": " The EventingIP field in the PEBS (Processor Event-Based Sampling) record reports the address of the instruction that triggered the PEBS event. Under certain complex microarchitectural conditions, the EventingIP field may be incorrect",
        "implication": "When this erratum occurs, performance monitoring software may not attribute the PEBS events to the correct instruction.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL121": {
        "title": "Executing a 256-Bit AVX Instruction May Cause Unpredictable Behavior",
        "problem": "Under complex micro-architectural conditions, executing a 256 AVX bit instruction may result in unpredictable system behavior.",
        "implication": "When this erratum occurs, the system may behave unpredictably",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL122": {
        "title": "HWP’s Guaranteed_Performance Updated Only on Configurable TDP Changes",
        "problem": " According to HWP (Hardware P-states) specification, the Guaranteed_Performance field (bits[15:8]) in the IA32_HWP_CAPABILITIES MSR (771H) should be updated as a result of changes in the configuration of TDP, RAPL (Running Average Power Limit) and other platform tuning options that may have dynamic effects on the actual guaranteed performance support level. Due to this erratum, the processor will update the Guaranteed_Performance field only as a result of Configurable TDP dynamic changes",
        "implication": "Software may read a stale value of the Guaranteed _Performance field.",
        "workaround": "None identified",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL123": {
        "title": "Core and/or Ring Frequency May be Briefly Lower Than Expected After BIOS Completes",
        "problem": "Due to this erratum, the core and ring frequencies may be lower than expected for up to several seconds after BIOS completes",
        "implication": "Processing immediately after BIOS completes may take longer than expected. The erratum does not cause any functional failures.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL124": {
        "title": "RF May be Incorrectly Set in The EFLAGS That is Saved on a Fault in PEBS or BTS",
        "problem": " After a fault due to a failed PEBS (Processor Event Based Sampling) or BTS (Branch Trace Store) address translation, the RF (resume flag) may be incorrectly set in the EFLAGS image that is saved.",
        "implication": " When this erratum occurs, a code breakpoint on the instruction following the return from handling the fault will not be detected. This erratum only happens when the user does not prevent faults on PEBS or BTS.",
        "workaround": "Software should always prevent faults on PEBS or BTS.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL125": {
        "title": "Intel® PT ToPA PMI Does Not Freeze Performance Monitoring Counters",
        "problem": " Due to this erratum, if IA32_DEBUGCTL.FREEZE_PERFMON_ON_PMI (MSR 1D9H, bit 12) is set to 1 when Intel PT (Processor Trace) triggers a ToPA (Table of Physical Addresses) PMI (PerfMon Interrupt), performance monitoring counters are not frozen as expected.",
        "implication": "Performance monitoring counters will continue to count for events that occur during PMI handler execution.",
        "workaround": "PMI handler software can programmatically stop performance monitoring counters upon entry.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL126": {
        "title": "HWP’s Maximum_Performance Value is Reset to 0xFF",
        "problem": " According to HWP (Hardware P-states) specification, the reset value of the Maximum_Performance field (bits [15:8]) in IA32_HWP_REQUEST MSR (774h) should be set to the value of IA32_HWP_CAPABILITIES MSR (771H) Highest_Performance field (bits[7:0]) after reset. Due to this erratum, the reset value of Maximum_Performance is always set to 0xFF.",
        "implication": "Software may see an unexpected value in Maximum Performance field. Hardware clipping will prevent invalid performance states.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL127": {
        "title": "HWP’s Guaranteed_Performance and Relevant Status/Interrupt May be Updated More Than Once Per Second",
        "problem": " According to HWP (Hardware P-states) specification, the Guaranteed_Performance field (bits[15:8]) in the IA32_HWP_CAPABILITIES MSR (771H) and the Guaranteed_Performance_Change (bit 0) bit in IA32_HWP_STATUS MSR (777H) should not be changed more than once per second nor should the thermal interrupt associated with the change to these fields be signaled more than once per second. Due to this erratum, the processor may change these fields and generate the associated interrupt more than once per second.",
        "implication": "HWP interrupt rate due to Guaranteed_Performance field change can be higher than specified",
        "workaround": "Clearing the Guaranteed_Performance_Change status bit no more than once per second will ensure that interrupts are not generated at too fast a rate.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL128": {
        "title": "Some Memory Performance Monitoring Events May Produce Incorrect Results When Filtering on Either OS or USR Modes",
        "problem": " The memory at-retirement performance monitoring events (listed below) may produce incorrect results when a performance counter is configured in OS-only or USR-only modes (bits 17 or 16 in IA32_PERFEVTSELx MSR). Counters with both OS and USR bits set are not affected by this erratum. The list of affected memory at-retirement events is as follows: MEM_INST_RETIRED.STLB_MISS_LOADS event D0H, umask 11H MEM_INST_RETIRED.STLB_MISS_STORES event D0H, umask 12H MEM_INST_RETIRED.LOCK_LOADS event D0H, umask 21H MEM_INST_RETIRED.SPLIT_LOADS event D0H, umask 41H MEM_INST_RETIRED.SPLIT_STORES event D0H, umask 42H MEM_LOAD_RETIRED.L2_HIT event D1H, umask 02H MEM_LOAD_RETIRED.L3_HIT event D1H, umask 04H MEM_LOAD_RETIRED.L4_HIT event D1H, umask 80H MEM_LOAD_RETIRED.L1_MISS event D1H, umask 08H MEM_LOAD_RETIRED.L2_MISS event D1H, umask 10H MEM_LOAD_RETIRED.L3_MISS event D1H, umask 20H MEM_LOAD_RETIRED.FB_HIT event D1H, umask 40H MEM_LOAD_L3_HIT_RETIRED.XSNP_MISS event D2H, umask 01H MEM_LOAD_L3_HIT_RETIRED.XSNP_HIT event D2H, umask 02H MEM_LOAD_L3_HIT_RETIRED.XSNP_HITM event D2H, umask 04H MEM_LOAD_L3_HIT_RETIRED.XSNP_NONE event D2H, umask 08H",
        "implication": "The listed performance monitoring events may produce incorrect results including PEBS records generated at an incorrect point",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL129": {
        "title": "HWP May Generate Thermal Interrupt While Not Enabled",
        "problem": " Due to this erratum, the conditions for HWP (Hardware P-states) to generate a thermal interrupt on a logical processor may generate thermal interrupts on both logical processors of that core.",
        "implication": " If two logical processors of a core have different configurations of HWP (e.g. only enabled on one), an unexpected thermal interrupt may occur on one logical processor due to the HWP settings of the other logical processor.",
        "workaround": "Software should configure HWP consistently on all logical processors of a core.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL130": {
        "title": "Camera Device Does Not Issue an MSI When INTx is Enabled",
        "problem": " When both MSI (Message Signaled Interrupts) and legacy INTx are enabled by the camera device, INTx is asserted rather than issuing the MSI, in violation of the PCI Local Bus Specification.",
        "implication": "Due to this erratum, camera device interrupts can be lost leading to device failure.",
        "workaround": "The camera device must disable legacy INTx by setting bit 10 of PCICMD (Bus 0; Device 5; Function 0; Offset 04H) before MSI is enabled",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL131": {
        "title": "An x87 Store Instruction Which Pends #PE May Lead to Unexpected Behavior When EPT A/D is Enabled.",
        "problem": "An x87 store instruction which causes a #PE (Precision Exception) to be pended and updates an EPT (Extended Page Tables) A/D bit may lead to unexpected behavior.",
        "implication": "The VMM may experience unexpected x87 fault or a machine check exception with the value of 0x150 in IA32_MC0_STATUS.MCACOD (bits [15:0] in MSR 401H)",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL132": {
        "title": "System Hang or Machine Check May Occur When eDRAM Enabled",
        "problem": "A machine check exception may occur with an error reported in IA32_MC10_STATUS or may experience system hang at high temperatures",
        "implication": "When this erratum occurs, the system will generate a machine check error or result in a system hang.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL133": {
        "title": "RING_PERF_LIMIT_REASONS May be Incorrect",
        "problem": "Under certain conditions, RING_PERF_LIMIT_REASONS (MSR 6B1H) may incorrectly assert the OTHER status bit (bit 8) as well as the OTHER log bit (bit 24).",
        "implication": "When this erratum occurs, software using this register will incorrectly report clipping because of the OTHER reason.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL134": {
        "title": "BNDLDX And BNDSTX May Not Signal #GP on Non-Canonical Bound Directory Access",
        "problem": " BNDLDX and BNDSTX instructions access the bound’s directory and table to load or store bounds. These accesses should signal #GP (general protection exception) when the address is not canonical (i.e. bits 48 to 63 are not the sign extension of bit 47). Due to this erratum, #GP may not be generated by the processor when a non- canonical address is used by BNDLDX or BNDSTX for their bound directory memory access",
        "implication": "Intel has not observed this erratum with any commercially available software.",
        "workaround": "Software should use canonical addresses for bound directory accesses.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL135": {
        "title": "DTS Temperature Reading May be Inaccurate on DDR4 systems",
        "problem": " The temperature reported by the DTS (Digital Thermal Sensor) on DDR4 systems may vary from the actual temperature by +5°C to -15°C rather than the specified ±5°C.",
        "implication": "When this erratum occurs, CPU throttling may occur later than expected. Intel has not observed this erratum to have any impact on system.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL136": {
        "title": "Performance Monitoring Load Latency Events May Be Inaccurate For Gather Instructions",
        "problem": " The performance monitoring events MEM_TRANS_RETIRED.LOAD_LATENCY_* (Event CDH; UMask 01H; any latency) count load instructions whose latency exceed a predefined threshold, where the loads are randomly selected using the load latency facility (an extension of PEBS). However due to this erratum, these events may count incorrectly for VGATHER*/VPGATHER* instructions",
        "implication": "The Load Latency Performance Monitoring events may be Inaccurate for Gather instructions",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL139": {
        "title": "Some Bits in MSR_MISC_PWR_MGMT May be Updated on Writing Illegal Values to This MSR",
        "problem": " Attempts to write illegal values to MSR_MISC_PWR_MGMT (MSR 0x1AA) result in #GP (General Protection Fault) and should not change the MSR value. Due to this erratum, some bits in the MSR may be updated on writing an illegal value",
        "implication": "Certain fields may be updated with allowed values when writing illegal values to MSR_MISC_PWR_MGMT. Such writes will always result in #GP as expected.",
        "workaround": "None identified. Software should not attempt to write illegal values to this MSR.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL140": {
        "title": "Violations of Intel® Software Guard Extensions (Intel® SGX) Access-Control Requirements Produce #GP Instead of #PF",
        "problem": " Intel® Software Guard Extensions (Intel® SGX) define new access-control requirements on memory accesses. A violation of any of these requirements causes a page fault (#PF) that sets bit 15 (SGX) in the page-fault error code. Due to this erratum, these violations instead cause general-protection exceptions (#GP).",
        "implication": "Software resuming from system sleep states S3 or S4 and relying on receiving a page fault from the above enclave accesses may not operate properly.",
        "workaround": "Software can monitor #GP faults to detect that an enclave has been destroyed and needs to be rebuilt after resuming from S3 or S4",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL141": {
        "title": "IA32_RTIT_CR3_MATCH MSR Bits[11:5] Are Treated As Reserved",
        "problem": " Due to this erratum, bits[11:5] in IA32_RTIT_CR3_MATCH (MSR 572H) are reserved; an MSR writes that attempts to set that field to a non-zero value will result in a #GP fault.",
        "implication": " The inability to write the identified bit field does not affect the functioning of Intel® PT (Intel® Processor Trace) operation because, as described in erratum SKL061, the bit field that is the subject of this erratum is not used during Intel PT CR3 filtering.",
        "workaround": " Ensure that bits 11:5 of the value written to IA32_RTIT_CR3_MATCH are zero, including cases where the selected page-directory-pointer-table base address has non-zero bits in this range.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL142": {
        "title": "APIC Timer Interrupt May Not be Generated at The Correct Time In TSC- Deadline Mode",
        "problem": " After writing to the IA32_TSC_ADJUST MSR (3BH), any subsequent write to the IA32_TSC_DEADLINE MSR (6E0H) may incorrectly process the desired deadline. When this erratum occurs, the resulting timer interrupt may be generated at the incorrect time.",
        "implication": " When the local APIC (Advanced Programmable Interrupt Controller) timer is configured for TSC-Deadline mode, a timer interrupt may be generated much earlier than expected or much later than expected. Intel has not observed this erratum with most commercially available software.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL144": {
        "title": "Unpredictable System Behavior May Occur When System Agent Enhanced Intel® Speedstep® is Enabled",
        "problem": "Under complex system conditions, System Agent Enhanced Intel® Speedstep® may result in unpredictable system behavior.",
        "implication": "When this erratum occurs, the system may behave unpredictably.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL145": {
        "title": "Processor May Hang Under Complex Scenarios",
        "problem": "Under complex micro-architectural conditions, the processor may hang with an internal timeout error (MCACOD 0400H) logged into IA32_MCi_STATUS.",
        "implication": "This erratum results in a processor hang.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL146": {
        "title": "The Intel PT CR3 Filter is Not Re-evaluated on VM Entry",
        "problem": " On a VMRESUME or VMLAUNCH with both TraceEn[0] and CR3Filter[7] in IA32_RTIT_CTL (MSR 0570H) set to 1 both before the VM Entry and after, the new value of CR3 is not compared with IA32_RTIT_CR3_MATCH (MSR 0572H).",
        "implication": " The Intel PT (Processor Trace) CR3 filtering mechanism may continue to generate packets despite a mismatching CR3 value, or may fail to generate packets despite a matching CR3, as a result of an incorrect value of IA32_RTIT_STATUS.ContextEn[1] (MSR 0571H) that results from the failure to re-evaluate the CR3 match on VM entry.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL147": {
        "title": "Display Slowness May be Observed Under Certain Display Commands Scenario",
        "problem": "Back-to-back accesses to the VGA register ports (I/O addresses 0x3C2, 0x3CE, 0x3CF) will experience higher than expected latency.",
        "implication": "Due to this erratum, the processor may redraw the screen slowly when in VGA mode.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL148": {
        "title": "CPUID TLB Associativity Information is Inaccurate",
        "problem": " CPUID leaf 2 (EAX=02H) TLB information inaccurately reports that the shared 2nd- Level TLB is 6-way set associative (value C3H), although it is 12-way set associative. Other information reported by CPUID leaf 2 is accurate.",
        "implication": " Software that uses CPUID shared 2nd-level TLB associativity information for value C3H may operate incorrectly. Intel has not observed this erratum to impact the operation of any commercially available software.",
        "workaround": "None identified. Software should ignore the shared 2nd-Level TLB associativity information reported by CPUID for the affected processors.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL149": {
        "title": "Processor Graphics May Render Incorrectly or May Hang Following Warm Reset With Package C8 Disabled",
        "problem": "Processor Graphics may not properly restore internal configuration after warm reset when package C8 is disabled.",
        "implication": "Due to this erratum Processor Graphics may render incorrectly or hang on warm reset.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL150": {
        "title": "Short Loops Which Use AH/BH/CH/DH Registers May Cause Unpredictable System Behavior",
        "problem": " Under complex micro-architectural conditions, short loops of fewer than 64 instructions that use AH, BH, CH or DH registers as well as their corresponding wider register (e.g. RAX, EAX or AX for AH) may cause unpredictable system behavior. This can only happen when both logical processors on the same physical processor are active.",
        "implication": "Due to this erratum, the system may experience unpredictable system behavior.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL151": {
        "title": "Processor Graphics May Render Incorrectly or May Hang Following Warm Reset With Package C8 Disabled",
        "problem": "Processor Graphics may not properly restore internal configuration after warm reset when package C8 is disabled.",
        "implication": "Due to this erratum Processor Graphics may render incorrectly or hang on warm reset.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL152": {
        "title": "Unpredictable System Behavior May Occur in DDR4 Multi-Rank System",
        "problem": "Due to incorrect configuration of DDR4 ODT by BIOS, it is possible for a multi-rank system to violate section 4.27 of the DDR4 JEDEC spec revision JESED79-4A.",
        "implication": "Due to this erratum, complex microarchitectural conditions may result in unpredictable system behavior",
        "workaround": "A BIOS workaround has been identified. Please refer to Silicon Initialization version 2.1.0 or later and release notes",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL153": {
        "title": "Processor May Hang on Complex Sequence of Conditions",
        "problem": " A complex set of architectural and micro-architectural conditions may lead to a processor hang with an internal timeout error (MCACOD 0400H) logged into IA32_MCi_STATUS. When both logical processors in a core are active, this erratum will not occur unless there is no store on one of the logical processors for more than 10 seconds.",
        "implication": "This erratum may result in a processor hang. Intel has not observed this erratum with any commercially available software.",
        "workaround": "None Identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL154": {
        "title": "Intel® SGX Vulnerability May Impact Enclave Security",
        "problem": " There is a vulnerability that may allow a malicious party to impact the security of an SGX (Intel® Software Guard Extensions) enclave. Exploitation of the vulnerability requires the malicious party to modify BIOS code.",
        "implication": "Malicious Software may be able to modify enclave data or code.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL155": {
        "title": "MOVNTDQA From WC Memory May Pass Earlier Locked Instructions",
        "problem": " An execution of (V)MOVNTDQA (streaming load instruction) that loads from WC (write combining) memory may appear to pass an earlier locked instruction to a different cache line",
        "implication": "Software that expects a lock to fence subsequent (V)MOVNTDQA instructions may not operate properly.",
        "workaround": " Software should not rely on a locked instruction to fence subsequent executions of MOVNTDQA. Software should insert an MFENCE instruction if it needs to preserve order between streaming loads and other memory operations.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL156": {
        "title": "Spurious Corrected Errors May be Reported",
        "problem": " Due to this erratum, spurious corrected errors may be logged in the IA32_MC0_STATUS MSR (401H) register with the valid field (bit 63) set, the uncorrected error field bit (bit 61) not set, a Model Specific Error Code (bits [31:16]) of 0x0001, and an MCA Error Code (bits [15:0]) of 0x0005. If CMCI is enabled, these spurious corrected errors also signal interrupts.",
        "implication": " When this erratum occurs, software may see an unusually high rate of reported corrected errors. As it is not possible to distinguish between spurious and non- spurious errors, this erratum may interfere with reporting non-spurious corrected errors",
        "workaround": "None Identified",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL157": {
        "title": "Masked Bytes in a Vector Masked Store Instructions May Cause Write Back of a Cache Line",
        "problem": " Vector masked store instructions to WB (write-back) memory-type that cross cache lines may lead to CPU writing back cached data even for cache lines where all of the bytes are masked",
        "implication": " The processor may generate writes of un-modified data. This can affect MMIO (Memory Mapped IO) or non-coherent agents in the following ways: 1. For MMIO range that is mapped as WB memory type, this erratum may lead to MCE (Machine Check Exception) due to writing back data into the MMIO space. This applies only to cross page vector masked stores where one of the pages is in MMIO range. 2. If the CPU cached data is stale, for example in the case of memory written directly by a non-coherent agent (agent that uses non-coherent writes), this erratum may lead to writing back stale cached data even if these bytes are masked",
        "workaround": " Platforms should not map MMIO memory space or non-coherent device memory space as WB memory. If WB is used for MMIO range, software or VMM should not map such MMIO page adjacent to a regular WB page (adjacent on the linear address space, before or after the IO page). Memory that may be written by non-coherent agents should be separated by at least 64 bytes from regular memory used for other purposes (on the linear address space)",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL158": {
        "title": "WRMSR to IA32_BIOS_UPDT_TRIG Concurrent With an SMX SENTER/SEXIT May Result in a System Hang",
        "problem": " Performing WRMSR to IA32_BIOS_UPDT_TRIG (MSR 79H) on a logical processor while another logical processor is executing an SMX (Safer Mode Extensions) SENTER/SEXIT operation (GETSEC[SENTER] or GETSEC[SEXIT] instruction) may cause the processor to hang.",
        "implication": "When this erratum occurs, the system will hang. Intel has not observed this erratum with any commercially available system.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL159": {
        "title": "Use of VMASKMOV to Store When Using EPT May Fail",
        "problem": " Use of VMASKMOV instructions to store data that splits over two pages, when the instruction resides on the first page may cause a hang if EPT (Extended Page Tables) is in use, and the store to the second page requires setting the A/D bits in the EPT entry.",
        "implication": "Due to this erratum, the CPU may hang on the execution of VMASKMOV.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL160": {
        "title": "Writing Non-Zero Values to Read Only Fields in IA32_THERM_STATUS MSR May Cause #GP",
        "problem": "IA32_THERM_STATUS MSR (19CH) includes read-only (RO) fields as well as writable fields. Writing a non-zero value to any of the read-only fields may cause a #GP.",
        "implication": "Due to this erratum, software that reads the IA32_THERM_STATUS MSR, modifies some of the writable fields, and attempts to write the MSR back may #GP.",
        "workaround": "Software should clear all read-only fields before writing to this MSR",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL161": {
        "title": "Precise Performance Monitoring May Generate Redundant PEBS Records",
        "problem": " Processor Event Based Sampling (PEBS) may generate redundant records for a counter overflow when used to profile cycles. This may occur when a precise performance monitoring event is configured on a general counter while setting the Invert and Counter Mask fields in IA32_PERFEVTSELx MSRs (186H - 18DH), and the counter is reloaded with a value smaller than 1000 (through the PEBS-counter-reset field of the DS Buffer Management Area).",
        "implication": "PEBS may generate multiple redundant records, when used to profile cycles in certain conditions.",
        "workaround": " It is recommended for software to forbid the use of the Invert bit in IA32_PERFEVTSELx MSRs or restrict PEBS-counter-reset value to a value of at least 1000.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL162": {
        "title": "SGX ENCLS[EINIT] May Not Signal an Error For an Incorrectly Formatted SIGSTRUCT Input",
        "problem": " The ENCLS[EINIT] instruction leaf may not signal an error on a specific combination of SIGSTRUCT values even though the signature does not fully comply with RSA signature specifications",
        "implication": " When this erratum occurs, ENCLS[EINIT] instruction leaf may pass the checks although the SIGSTUCT signature doesn’t fully comply with RSA signature specifications. This erratum doesn’t compromise the security of SGX and does not impact normal usage of SGX.",
        "workaround": "None identified. Software is not expected to be impacted by this erratum.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL163": {
        "title": "Branch Instruction Address May be Incorrectly Reported on TSX Abort When Using MPX",
        "problem": " When using Intel® Memory Protection Extensions (MPX), an Intel® Transactional Synchronization Extensions (TSX) transaction abort will occur in case of legacy branch (that causes bounds registers INIT) when at least one MPX bounds register was in a NON-INIT state. On such an abort, the branch Instruction address should be reported in the FROM_IP field in the Last Branch Records (LBR), Branch Trace Store (BTS) and Branch Trace Message (BTM) as well as in the Flow Update Packets (FUP) source IP address for Processor Trace (PT). Due to this erratum, the FROM_IP field in LBR/BTS/BTM, as well as the Flow Update Packets (FUP) source IP address that corresponds to the TSX abort, may point to the preceding instruction.",
        "implication": "Software that relies on the accuracy of the FROM_IP field / FUP source IP address and uses TSX may operate incorrectly when MPX is used.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL164": {
        "title": "Setting Performance Monitoring IA32_PERF_GLOBAL_STATUS_SET MSR Bit 63 May Not #GP",
        "problem": "Bit 63 of IA32_PERF_GLOBAL_STATUS_SET MSR (391H) is reserved. Due to this erratum, setting the bit will not result in General Protection Fault (#GP).",
        "implication": "Software that attempts to set bit 63 of IA32_PERF_GLOBAL_STATUS_SET MSR does not generate #GP. There are no other system implications to this behavior",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL165": {
        "title": "Hitting a Code Breakpoint Inside a SGX Debug Enclave May Cause The Processor to Hang",
        "problem": " Under complex microarchitecture conditions, the processor may hang when hitting a code breakpoint inside an SGX (Intel® Software Guard Extensions) debug enclave. This may happen only after opt-out entry into an SGX debug enclave and when the execution would set the accessed bit (A-bit) in any level of the paging or EPT (extended page table) structures used to map the code page, and when both logical processors on the same physical core are active.",
        "implication": "Due to this erratum, the processor may hang while debugging an SGX debug enclave.",
        "workaround": "None identified.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL166": {
        "title": "Performance Monitoring ASCI Status Bit May be Inaccurate",
        "problem": " The ASCI (Anti Side-Channel Interference) field in IA32_PERF_GLOBAL_STATUS (MSR 38EH, bit 60) should be set when the count in any of the configured performance counters (i.e. IA32_PMCx or IA32_FIXED_CTRx) was altered due to direct or indirect operation of Intel® SGX. Due to this erratum, the ASCI bit may not be set properly when IA32_FIXED_CTR0 is used.",
        "implication": "Software that relies on the value of the ASCI bit in IA32_PERF_GLOBAL_STATUS for its operation may not operate correctly when IA32_FIXED_CTR0 is used.",
        "workaround": "None identified",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL167": {
        "title": "Processor May Hang When Executing Code In an HLE Transaction Region",
        "problem": " Under certain conditions, if the processor acquires an HLE (Hardware Lock Elision) lock via the XACQUIRE instruction in the Host Physical Address range between 40000000H and 403FFFFFH, it may hang with an internal timeout error (MCACOD 0400H) logged into IA32_MCi_STATUS.",
        "implication": "Due to this erratum, the processor may hang after acquiring a lock via XACQUIRE.",
        "workaround": " BIOS can reserve the host physical address ranges of 40000000H and 403FFFFFH (e.g. map it as UC/MMIO). Alternatively, the VMM (Virtual Machine Monitor) can reserve that address range so no guest can use it. In non-virtualized systems, the OS can reserve that memory space.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL168": {
        "title": "Intel® PT CYC Packets Can be Dropped When Immediately Preceding PSB",
        "problem": " Due to a rare microarchitectural condition, generation of an Intel® PT (Processor Trace) PSB (Packet Stream Boundary) packet can cause a single CYC (Cycle Count) packet, possibly along with an associated MTC (Mini Time Counter) packet, to be dropped",
        "implication": "An Intel® PT decoder that is using CYCs to track time or frequency will get an improper value due to the lost CYC packet",
        "workaround": " If an Intel® PT decoder is using CYCs and MTCs to track frequency, and either the first MTC following a PSB shows that an MTC was dropped, or the CYC value appears to be 4095 cycles short of what is expected, the CYC value associated with that MTC should not be used. The decoder should wait for the next MTC before measuring frequency again.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL169": {
        "title": "Intel® PT VM-entry Indication Depends on The Incorrect VMCS Control Field",
        "problem": " An Intel® Processor Trace PIP (Paging Information Packet), which includes indication of entry into non-root operation, will be generated on VM-entry as long as the “Conceal VMX in Intel® PT” field (bit 19) in Secondary Execution Control register (IA32_VMX_PROCBASED_CTLS2, MSR 048BH) is clear. This diverges from expected behavior, since this PIP should instead be generated only with a zero value of the “Conceal VMX entries from Intel® PT” field (Bit 17) in the Entry Control register (IA32_VMX_ENTRY_CTLS MSR 0484H).",
        "implication": "An Intel® PT trace may incorrectly expose entries to non-root operation.",
        "workaround": " A VMM (virtual machine monitor) should always set both the “Conceal VMX entries from Intel® PT” field in the Entry Control register and the “Conceal VMX in Intel® PT” in the Secondary Execution Control register to the same value.",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL170": {
        "title": "VCVTPS2PH To Memory May Update MXCSR in The Case of a Fault on The Store",
        "problem": " Execution of the VCVTPS2PH instruction with a memory destination may update the MXCSR exceptions flags (bits [5:0]) if the store to memory causes a fault (e.g., #PF) or VM exit. The value written to the MXCSR exceptions flags is what would have been written if there were no fault.",
        "implication": " Software may see exceptions flags set in MXCSR, although the instruction has not successfully completed due to a fault on the memory operation. Intel has not observed this erratum to affect any commercially available software.",
        "workaround": "None identified",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL171": {
        "title": "Intel® PT May Drop All Packets After an Internal Buffer Overflow",
        "problem": " Due to a rare microarchitectural condition, an Intel® PT (Processor Trace) ToPA (Table of Physical Addresses) entry transition can cause an internal buffer overflow that may result in all trace packets, including the OVF (Overflow) packet, being dropped.",
        "implication": " When this erratum occurs, all trace data will be lost until either PT is disabled and re- enabled via IA32_RTIT_CTL.TraceEn [bit 0] (MSR 0570H) or the processor enters and exits a C6 or deeper C state.",
        "workaround": "None identified",
        "status": "For the stepping’s affected, see the Summary Table of Changes."
    },
    "SKL172": {
        "title": "Intel® PT ToPA Tables Read From Non-Cacheable Memory During an Intel® TSX Transaction May Lead to Processor Hang",
        "problem": " If an Intel® PT (Processor Trace) ToPA (Table of Physical Addresses) table is placed in UC (Uncacheable) or USWC (Uncacheable Speculative Write Combining) memory, and a ToPA output region is filled during an Intel® TSX (Transaction Synchronization) transaction, the resulting ToPA table read may cause a processor hang.",
        "implication": "Placing Intel® PT ToPA tables in non-cacheable memory when Intel® TSX is in use may lead to a processor hang.",
        "workaround": "None identified. Intel PT ToPA should reside in WB memory and should not be written within a Transactional Region.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL173": {
        "title": "Performing an XACQUIRE to an Intel® PT ToPA Table May Lead to Processor Hang",
        "problem": " If an XACQUIRE lock is performed to the address of an Intel® PT (Processor Trace) ToPA (Table of Physical Addresses) table, and that table is later read by the CPU during the HLE (Hardware Lock Elision) transaction, the processor may hang.",
        "implication": "Accessing ToPA tables with XACQUIRE may result in a processor hang.",
        "workaround": " None identified. Software should not access ToPA tables using XACQUIRE. An OS or hypervisor may wish to ensure all application or guest writes to ToPA tables to take page faults or EPT violations.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL174": {
        "title": "ZMM/YMM Registers May Contain Incorrect Values",
        "problem": "Under complex microarchitectural conditions values stored in ZMM and YMM registers may be incorrect.",
        "implication": "Due to this erratum, YMM and ZMM registers may contain an incorrect value. Intel® has not observed this erratum with any commercially available software.",
        "workaround": "It is possible for BIOS to contain a workaround for this erratum.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL175": {
        "title": "Intel® PT CYC Packets Can be Dropped When Immediately Preceding PSB",
        "problem": " Due to a rare microarchitectural condition, generation of an Intel® PT (Processor Trace) PSB (Packet Stream Boundary) packet can cause a single CYC (Cycle Count) packet, possibly along with an associated MTC (Mini Time Counter) packet, to be dropped.",
        "implication": "An Intel® PT decoder that is using CYCs to track time or frequency will get an improper value due to the lost CYC packet.",
        "workaround": " If an Intel® PT decoder is using CYCs and MTCs to track frequency, and either the first MTC following a PSB shows that an MTC was dropped, or the CYC value appears to be 4095 cycles short of what is expected, the CYC value associated with that MTC should not be used. The decoder should wait for the next MTC before measuring frequency again.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL176": {
        "title": "When Virtualization Exceptions are Enabled, EPT Violations May Generate Erroneous Virtualization Exceptions",
        "problem": " An access to a GPA (guest-physical address) may cause an EPT-violation VM exit. When the “EPT-violation #VE” VM-execution control is 1, an EPT violation may cause a #VE (virtualization exception) instead of a VM exit. Due to this erratum, an EPT violation may erroneously cause a #VE when the “suppress #VE” bit is set in the EPT paging-structure entry used to map the GPA being accessed. This erratum does not apply when the “EPT-violation #VE” VM-execution control is 0 or when delivering an event through the IDT. This erratum applies only when the GPA in CR3 is used to access the root of the guest paging-structure hierarchy (or, with PAE paging, when the GPA in a PDPTE is used to access a page directory).",
        "implication": " When using PAE paging mode, an EPT violation that should cause an VMexit in the VMM may instead cause a VE# in the guest. In other paging modes, in addition to delivery of the erroneous #VE, the #VE may itself cause an EPT violation, but this EPT violation will be correctly delivered to the VMM.",
        "workaround": "A VMM may support an interface that guest software can invoke with the VMCALL instruction when it detects an erroneous #VE.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL177": {
        "title": "System May Hang With Multiple Pending Posted Writes When Using Direct MMIO Write Access Model",
        "problem": " Under complex conditions, if a device fails to consume at least 8 posted writes within 5us and its device driver uses a Direct MMIO write access software model and Enhanced Intel® Speed Step® Technology is enabled, the system may hang with an internal timer error machine check with error code IA32_MCi_STATUS[15:0] = 0x0400.",
        "implication": ": Due to this erratum, the system may hang. Intel has only observed this erratum to occur with a direct MMIO write access model. Implication Due to this erratum, the system may hang. Intel has only observed this erratum to occur with a direct MMIO write access model.",
        "workaround": "None identified.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL178": {
        "title": "Using Intel® TSX Instructions May Lead to Unpredictable System Behavior",
        "problem": "Under complex microarchitectural conditions, software using Intel® TSX (Transactional Synchronization Extensions) may result in unpredictable system behavior. Intel has only seen this under synthetic testing conditions. Intel is not aware of any commercially available software exhibiting this behavior.",
        "implication": "Due to this erratum, unpredictable system behavior may occur.",
        "workaround": "It is possible for BIOS to contain a workaround for this erratum.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL179": {
        "title": "Performance Monitoring General Purpose Counter 3 May Contain Unexpected Values",
        "problem": "When Restricted Transactional Memory (RTM) is supported (CPUID.07H.EBX.RTM [bit 11] = 1) and when TSX_FORCE_ABORT=0, Performance Monitor Unit (PMU) general purpose counter 3 (IA32_PMC3, MSR C4H and IA32_A_PMC3, MSR 4C4H) may contain unexpected values. Further, IA32_PREFEVTSEL3 (MSR 189H) and IA32_PERF_GLOBAL_CTRL[3] (MSR 38FH) may contain unexpected configuration values; which may also affect IA32_PERF_GLOBAL_INUSE[3] (MSR 392H).",
        "implication": "Due to this erratum, software that uses PMU general purposes counter 3 may read an unexpected count and configuration.",
        "workaround": "Software can avoid this erratum by writing 1 to bit 0 of TSX_FORCE_ABORT (MSR 10FH) which will cause all Restricted Transactional Memory (RTM) transactions to abort with EAX code 0. TSX_FORCE_ABORT MSR is available when CPUID.07H.EDX[bit 13]=1.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL180": {
        "title": "Unexpected Uncorrected Machine Check Errors May Be Reported",
        "problem": "In rare micro-architectural conditions, the processor may report unexpected machine check errors. When this erratum occurs, IA32_MC0_STATUS (MSR 401H) will have the valid bit set (bit 63), the uncorrected error bit set (bit 61), a model specific error code of 03H (bits [31:16]) and an MCA error code of 05H (bits [15:0]).",
        "implication": "Due to this erratum, software may observe unexpected machine check exceptions.",
        "workaround": "None identified.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL181": {
        "title": "Intel® PT Trace May Drop Second Byte of CYC Packet",
        "problem": "Due to a rare microarchitectural condition, the second byte of a 2-byte CYC (Cycle Count) packet may be dropped without an OVF (Overflow) packet.",
        "implication": "A trace decoder may signal a decode error due to the lost trace byte.",
        "workaround": "None identified. A mitigation is available for this erratum. If a decoder encounters a multi-byte CYC packet where the second byte has bit 0 (Ext) set to 1, it should assume that 4095 cycles have passed since the prior CYC packet, and it should ignore the first byte of the CYC and treat the second byte as the start of a new packet.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL182": {
        "title": "Executing Some Instructions May Cause Unpredictable Behavior",
        "problem": "Under complex micro-architectural conditions, executing an X87, AVX, or integer divide instruction may result in unpredictable system behavior.",
        "implication": "When this erratum occurs, the system may behave unpredictably. Intel has not observed this erratum with any commercially available software.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL183": {
        "title": "A Pending Fixed Interrupt May Be Dispatched Before an Interrupt of The Same Priority Completes",
        "problem": "Resuming from C6 Sleep-State, with Fixed Interrupts of the same priority queued (in the corresponding bits of the IRR and ISR APIC registers), the processor may dispatch the second interrupt (from the IRR bit) before the first interrupt has completed and written to the EOI register, causing the first interrupt to never complete.",
        "implication": "Due to this erratum, Software may behave unexpectedly when an earlier call to an Interrupt Handler routine is overridden with another call (to the same Interrupt Handler) instead of completing its execution.",
        "workaround": "It is possible for the BIOS to contain a workaround for this erratum.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL184": {
        "title": "Incorrect Execution of Internal Branch Instructions May Lead to Unpredictable System Behavior",
        "problem": "Under complex microarchitecture conditions, incorrect execution of internal branch instructions that span multiple 64 byte boundaries (cross cache line), may result in unpredictable system behavior including unexpected #PF (page faults) or #UD (Invalid Opcode) faults due to incorrect execution of internal branch operations.",
        "implication": "When this erratum occurs, the system may exhibit unpredictable system behavior including unexpected #PF (page faults) or #UD (Invalid Opcode) faults.",
        "workaround": "It is possible for BIOS to contain a workaround for this erratum.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL185": {
        "title": "Processor May Behave Unpredictably on Complex Sequence of Conditions Which Involve Branches That Cross 64 Byte Boundaries",
        "problem": "Under complex micro-architectural conditions involving branch instructions bytes that span multiple 64 byte boundaries (cross cache line), unpredictable system behavior may occur.",
        "implication": "When this erratum occurs, the system may behave unpredictably.",
        "workaround": "It is possible for BIOS to contain a workaround for this erratum.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL186": {
        "title": "A PMI That Freezes LBRs Can Cause a Duplicate Entry in TOS",
        "problem": "If a PMI (Performance Monitor Interrupt) is taken while LBRs (Last Branch Records) are enabled and IA32_DEBUGCTL.FREEZE_LBRS_ON_PMI[bit 11]=1 (MSR 01D9H), a taken branch that performs an LBR update near the time of the PMI may instead record a duplicate of the prior entry into the TOS (Top of Stack) entry.",
        "implication": "Software may unexpectedly observe the appearance of back-to-back execution of the same branch.",
        "workaround": "In general, software can ignore the TOS entry if it matches the TOS-1 entry. Note that certain code sequences with no intervening taken branches can legitimately insert a valid duplicate LBR record in the TOS entry.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL187": {
        "title": "SGX Key Confidentiality May be Compromised",
        "problem": "Under complex micro-architectural conditions, it may be possible for the value of SGX keys to be inferred using speculative execution side channel methods.",
        "implication": "If exposed, such keys could allow an attacker to access SGX enclave data. Processors that do not support Hyper-Threading are not affected by this issue.",
        "workaround": "It is possible for BIOS to contain a workaround for this erratum.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL188": {
        "title": "Unexpected Page Faults in Guest Virtualization Environment",
        "problem": "Under complex micro-architectural conditions, a virtualized guest could observe unpredictable system behavior.",
        "implication": "When this erratum occurs, systems operating in a virtualization environment may exhibit unexpected page faults (double faults) leading to guest OS shutdown.",
        "workaround": "It is possible for BIOS to contain a workaround for this erratum.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL189": {
        "title": "System May Hang Under Complex Conditions",
        "problem": "Under complex conditions, insufficient access control in graphics subsystem may lead to a system hang or crash upon a register read.",
        "implication": "When this erratum occurs a system hang or crash may occur.",
        "workaround": "It is possible for a combination of BIOS and a graphics driver to contain a workaround for this erratum.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL190": {
        "title": "Instruction Fetch May Cause Machine Check if Page Size Was Changed Without Invalidation",
        "problem": "This erratum may cause a machine-check error (IA32_MCi_STATUS.MCACOD=005H with IA32_MCi_STATUS.MSCOD=00FH or IA32_MCi_STATUS.MCACOD=0150H with IA32_MCi_STATUS.MSCOD=00FH) on the fetch of an instruction. It applies only if (1) instruction bytes are fetched from a linear address translated using a 4-Kbyte page and cached in the processor; (2) the paging structures are later modified so that these bytes are translated using a large page (2-Mbyte, 4-Mbyte or 1-GByte) with a different physical address (PA), memory type (PWT, PCD and PAT bits), or User/Supervisor (U/S) bit; and (3) the same instruction is fetched after the paging structure modification but before software invalidates any TLB entries for the linear region.",
        "implication": "Due to this erratum an unexpected machine check with error code 0150H with MSCOD 00FH may occur, possibly resulting in a shutdown. This erratum could also lead to unexpected correctable machine check (IA32_MCi_STATUS.UC=0) with error code 005H with MSCOD 00FH.",
        "workaround": "Software should not write to a paging-structure entry in a way that would change the page size and either the physical address, memory type or User/Supervisor bit. It can instead use one of the following algorithms: first clear the P flag in the relevant paging-structure entry (e.g., PDE); then invalidate any translations for the affected linear addresses; and then modify the relevant paging-structure entry to set the P flag and establish the new page size. An alternative algorithm: first change the physical page attributes (combination of physical address, memory type and User/Supervisor bit) in all 4K pages in the affected linear addresses; then invalidate any translations for the affected linear addresses; and then modify the relevant paging-structure entry to establish the new page size.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL191": {
        "title": "PEG PCIe Link May Fail to Link When Resuming From PKG-C8",
        "problem": "PEG IO registers may not be restored after resuming from PKG-C8. Alternate problem: The processor's PCIe root port configuration registers may not be properly restored when resuming from PKG-C8.",
        "implication": "PEG PCIe may fail to link when resuming from PKG-C8. Note: PCIe add-in cards that do not support the L2 state do not encounter this issue as they do not allow the platform to enter PKG-C8. Alternate problem: The processor PCIe root port may fail to establish a link when resuming from PKG-C8.",
        "workaround": "A fix for this erratum is available in microcode. Please see Microcode Update Tables in this document.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL192": {
        "title": "Incorrect ECC Errors Reporting Following Entry to PKG-C7",
        "problem": "The Correctable and Uncorrectable ECC error address reported in ECCERRLOG0/1 (MCHBAR Offset 4048h/404Ch) may be overwritten after a PKG-C7 event.",
        "implication": "DDR Correctable and Uncorrectable ECC errors reported in ECCERRLOG0/1 (MCHBAR Offset 4048h/404Ch) may report an incorrect error address after resuming from PKG- C7.",
        "workaround": "None identified.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL193": {
        "title": "PMU MSR_UNC_PERF_FIXED_CTR is Cleared After Pkg C7 or Deeper",
        "problem": "The Performance Monitoring Unit Uncore Performance Fixed Counter (MSR_UNC_PERF_FIXED_CTR (MSR 395h)) is cleared after pkg C7 or deeper.",
        "implication": "Due to this erratum, once the system enters pkg C7 or deeper the uncore fixed counter does not reflect the actual count.",
        "workaround": "None identified.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL194": {
        "title": "Performance Monitoring General Counter 2 May Have Invalid Value Written When TSX Is Enabled",
        "problem": "When Transactional Synchronization Extensions (TSX) is enabled, and there are aborts (HLE or RTM) overlapping with access or manipulation of the IA32_PMC2 general-purpose performance counter (Offset: C3h) it may return invalid value.",
        "implication": "Software may read invalid value from IA32_PMC2.",
        "workaround": "None identified.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL195": {
        "title": "Display VT-d TLB invalidation during disabling of VTd Translations May Cause Display Corruption or Flickering",
        "problem": "If a hypervisor/VMM has enabled VTd translations for the Gfx IOMMU (TE=1 in VTd specification) and then switches the Gfx IOMMU to disable translations (TE=0) with DMA remapping enabled in the BIOS, the display VTd TLB may be invalidated without waiting for any pending memory requests to complete.",
        "implication": "Due to this erratum, momentary display corruption or flickering may occur during boot.",
        "workaround": "None identified.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL196": {
        "title": "Processor May Hang if Warm Reset Triggers During BIOS Initialization",
        "problem": "Under complex micro-architectural conditions, when the processor receives a warm reset during BIOS initialization, the processor may hang with a machine check error reported in IA32_MCi_STATUS, with MCACOD (bits [15:0]) value of 0400H, and MSCOD (bits [31:16]) value of 0080H.",
        "implication": "Due to this erratum, the processor may hang. Intel has only observed this erratum in a synthetic test environment.",
        "workaround": "None identified.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    },
    "SKL198": {
        "title": "MD_CLEAR Operations May Not Properly Overwrite All Buffers",
        "problem": "Problem: On processors that enumerate the MD_CLEAR CPUID bit (CPUID.(EAX=7H,ECX=0):EDX[MD_CLEAR=10] ), L1D_FLUSH, RSM, and VERW memory instructions should overwrite affected buffers with constant data. Under complex micro-architectural conditions, these instructions may not overwrite all affected buffers.",
        "implication": "Due to this erratum, the use of MD_CLEAR operations to prevent MDS (Microarchitectural Data Sampling) or TAA (Intel® Transactional Synchronization Extensions Asynchronous Abort) side-channel methods from revealing previously accessed data may not be fully effective.",
        "workaround": "It is possible for BIOS to contain a workaround for this erratum.",
        "status": "For the steppings affected, see the Summary Table of Changes."
    }
}